---


layout: 网络工程师
title: 网络工程师知识
date: 2023-12-02 00:16:43
tags:
---
# 
    因为要混饭吃，被迫学习网络知识，顺便了解一下物理的网络结构
## 申明
    因为是自己用来学习的，大部分前辈都进行了很好的总结，我会将互联网各种资料整合起来,再加上自己的理解来写这篇文章，仅供个人学习用途
# 正文

## 常见的网络设备

<!--more-->

### 1.网络交换机

    交换机使用内容可寻址存储器(Content Addressable Memory, CAM), 因此可以记住设备所插入的端口。思科公司生产的交换机被设计可用于从小型机构到有数千台设备的大型企业网络。
    
    交换机的基本功能是利用设备的 MAC 地址（第二层）和 IP 地址（第三层）来运行，它们也能完成更为复杂的一些工作，比如包括基于 permit/deny（运行或访问）、协议及端口号（第四层），还有综合各层及其它方面的策略和规则的处理列表（porcessing lists）。
    
    早期版本的交换机又被叫做网桥。网桥查看数据帧的源端口和 MAC 地址，以建立一个表并做出转发决定。在网桥上，有相应软件来访问这个表，在交换机上，则是由硬件（专用集成电路， Application Specific Integreated Chips, ASIC）去访问 CAM 表。因此交换机可以看成是一台多端口网桥。
    
    采行交换机可以将你的网络划分成更小的、更可管理的部分（就是网段，segments）。进而允许单位内部的不同部门，比如人力资源、财务、法务等等，得以同时在各自的网段上工作，这是十分有用的，因为同一部门的设备大部分时间都是用于各自之间的通信。


    通过交换机，你还可以更好地使用 IP 电话，因为交换机端口能够通过端口为其供电（使用 PoE 接口）。基本的网络交换机用于：
    
    1.连接诸如打印机和 PC 这样的网络设备
    2.赋予网络服务器和路由器网络访问
    3.使用 VLAN 对网络进行划分
    VLAN 就是虚拟局域网。
<!--more-->
### 2.网络路由器

    作为一名思科工程师，你将耗费大量时间来对路由器进行安装、配置以及故障排除。为此，CCNA 大纲超过半数的内容都是用于学习路由器配置的。
    
    路由器是用于建立网络的设备。与负责同一网络上的设备相互通信的交换机不同，路由器实现不同网络上的设备之间的通信。老旧型号的路由器上只有端口，这些端口都是物理内建与其中，固定在主板上的。这样的路由器仍然时不时的可以见到，但现代网络需要路由器具备 IP 电话、交换及安全以及能够连接到不同类型电讯公司的功能。因此，路由器是模块化的了，这就是说你有路由器机架和一些空着的插槽，能够连接大量的路由或交换模块。
![](https://ccna60d.xfoss.com/images/60days-13.png)
![](https://ccna60d.xfoss.com/images/60days-4.png)
路由器，routers


![](https://ccna60d.xfoss.com/images/60days-5.png)
交换机，routers


![](https://ccna60d.xfoss.com/images/60days-6.png)
有防火墙的路由器


![](https://ccna60d.xfoss.com/images/60days-7.png)
无线路由器

![](https://ccna60d.xfoss.com/images/60days-8.png)
多层交换机

![](https://ccna60d.xfoss.com/images/60days-12.png)
防火墙



## 局域网和广域网拓扑

| 拓扑   | 物理 | 逻辑 |
| ------ | ---- | ---- |
| 星形   | 星形 | 总线 |
| 令牌环 | 星形 | 环形 |
| 点对点 | 总线 | 总线 |
| FDDI   | 环形 | 环形 |



## OSI 和 TCP 模型

```
开放标准互连（Open Standards Interconnection, OSI）是有国际标准化组织创建的。伴随技术喷发，网络设备和网络软件行业兴起了几家巨头，包括思科、微软、Novell、IBM、惠普、苹果以及其它几家公司。每家都有自己的线缆和端口类型，允许各自的商业性协议。此时，如你从一家买路由器、另一家买交换机，又从别家买服务器，就会出现兼容性问题。

有一些处理这些问题的通容办法，比如在网络上部署网关来转换不同的协议，这会导致性能上的瓶颈（比如网络慢速部分）并会令到故障排除十分困难和费时。最终，厂商们不得不达成一个在各自产品上都能工作的通用标准，一套叫做 TCP/IP 的免费协议包。最后，那些未能采行 TCP/IP 的厂商失去市场份额，走向破产。

ISO 创建出 OSI 模型，以助力于各厂商就通用标准达成一致，实现厂商之间的兼容。此模型包括了将总多网络功能分解为一套逻辑分层，或通俗地称为层的东西。各层只需完成其特定的一些功能，比如说你的公司专注于防火墙，那么这些防火墙将自然地与其它厂商的设备一起工作。

此模型的优势在于每件设备设计用来出色完成一个角色，而非不充分地完成多个角色。客户可以根据其解决方案选出最好的设备，而不用死栓在一家厂商那里。同时故障排除也变得更为容易，因为确定的出错可被追踪到具体的某层。

OSI 模型将所有网络功能划分为七个不同的层。该层次化模型从第七层一路去往第一层。那些离用户更近、更为复杂的功能，在顶部，一直到处于底层的网络线缆规格，如同表
```

| 层   | 层名                  |
| ---- | --------------------- |
| 7    | 应用层，Application   |
| 6    | 表示层, Presentation  |
| 5    | 会话层, Session       |
| 4    | 传输层, Transport     |
| 3    | 网络层, Network       |
| 2    | 数据链路层, Data Link |
| 1    | 物理层, Physical      |

"**A**ll **P**eople **S**eem **T**o **N**eed **D**ata **P**rocessing"

在数据为通过物理网络介质传输而自顶层传至底层时，数据被放入不同的逻辑数据套盒子。尽管我们常把这些数据盒子称作“包（packets）”, 实际上根据其处于 OSI 不同的层而有不同的名称。从 OSI 模型往下的数据处理，叫做封装。而往上的处理中从盒子里取出数据的过程，叫做解封装。

### **第七层 -- 应用层**

这是到你我这些终端用户最近的层。应用层并非操作系统，但它通常提供了诸如 e-mail(SMTP 以及 POP3)、web 浏览（使用 HTTP）、以及文件传输服务（使用 FTP）。应用层决定了资源的可用性。

### **第六层--表示层**

表示层将数据提供给应用层。多媒体技术工作在这一层，你可以想到 MP4、JPEG、GIF 等等。而加密、解密以及数据压缩都发生在这一层。

### **第五层--会话层**

会话层的角色是建立、管理及中断设备之间的会话。这些动作发生在逻辑链路上，而真正干的事情是将两个软件应用程序连接起来。SQL、RPC 以及 NFS 都工作于会话层。

### **第四层--传输层**

传输层的角色是将来自更高层的数据分拆成被称为数据段（segments）的更小片。虚电路（virtual circuits）在这里建立，在设备之间能够通信之间有赖于虚电路的建立。

在数据得以跨网络传输前，传输层需要确认多少数据能发往远端设备。这取决于端到端链路的速率和可靠性。如你有一条高速链路，而终端用户只有一条低速链路，数据仍然需要以较小数据块进行发送。

以下是三种控制数据流的方法：

- 流控 flow control
- 窗口机制 windowing
- 通告机制 acknowledgements

#### **流控**

如发往接收系统的信息多于它所能处理的量时，它将请求发送系统暂停一段时间。这一般发生在一段使用宽带而另一端使用拨号上网的时候。这个用于通知其它设备停止的包叫做源抑制消息（a source quench message）。

#### **窗口机制**

窗口机制下，每个系统就能在收到应答（acknowledgement）前发送多少数据达成一致。"窗口"随着数据的传输时开时合，以维持一个持续的数据流。

#### **通告机制**

在收到一定数量的数据段后，接收端需要就这些数据段的安全抵达和顺序正确，通告发送端。

```
这些都是在一个叫做三次握手（a three-way handshake）的过程中达成一致。你要发出一个包来建立会话。第一个包叫做同步(synchronise, SYN)包。远端设备以同步应答（a synchronise acknowledgement, SYN-ACK）包予以回应。第三步的应答包（acknowledgement, ACK）的发出标志着会话的建立。这都是通过 TCP 业务完成的。

传输层包含了好几个协议，其中最熟知的是传输控制协议（Tranmission Control Protocol, TCP）和用户数据报协议（User Datagram Protocol, UDP）, 它们都是 TCP/IP 协议包的组成部分。这个协议包因为是互联网所使用的标准而相当出名。TCP 是面向连接的协议。它使用了三次握手、窗口机制以及其它技巧来保证数据安全地到达其目的地。有许多协议都使用了 TCP， 比如 Telnet、HTTPS 以及 FTP（尽管 FTP 位于应用层，它确实使用了 TCP）。

UDP 是一个无连接协议（a connectionless protocol）。它在对数据包进行编号后就发往目的地了。它绝不会管这些数据包是否安全抵达，也绝不会在发送数据包前建立一条连接。在数据不是那么重要，应用开发者觉得信息总是可以在未能到达目的地时重新发送时，往往采用 UDP。

那么为什么要用到 UDP 呢？ TCP 协议本身会消耗许多网络的带宽，甚至在数据还没发送时，为建立其连接，也要往复发送很多流量。这都会耗去一些宝贵的时间和网络资源。UDP 数据包比起 TCP 包要小很多，在无需真正可靠连接时，它是是否有用的。使用到 UDP 的协议有 TFTP 等。
```

### **第三层 -- 网络层**

```
网络层接手来自传输层的数据段，将其拆分为叫做数据包的更小单位。许多网络工程师不管在 OSI 的哪层，都把数据叫做包，这也是可以的。但是，请记住，技术上说只有在网络层，才可以叫包。

网络层必须确定从一个网络到另一网络的最优路径；为此，路由器工作在该层。路由器在此采用逻辑寻址，而 TCP/IP 的寻址方式是 IP 寻址，稍后会讲到。
```

### **第二层--数据链路层**

```
数据链路层将数据包拆分成帧这种更小的单位。二层交换机工作在这层，使用硬件地址，或是 MAC 地址，它们之所以能够更快地交换流量，是因为无需查看 IP 地址和路由表。广域网协议工作在第二层，包括 HDLC、ISDN 以及 PPP。以太网也是第二层的。

为了向其上下两层提供接口-，数据链路层又分了两个子层，分别是逻辑链路控制子层（the Logical Link Control, LLC）, 以及介质访问控制子层（ the Media Access Control, MAC）。逻辑链路控制子层与网络层交互，介质访问控制子层与物理层交互。
```



### **第一层--物理层**

```
在这层上，帧被转换为位，以将其放到线路上。这些位是由电脉冲构成，读作“开”“关”位，或是二进制的 1 和 0。集线器工作于此层，在这里你会找到线缆规格，比如 RJ45。
```

### **OSI故障排查**

```
在对你的网络进行故障排除时，采用层次化方法是十分有效的。至此，你唯一要明确的是从哪个方向上运用 OSI 协议栈，是自顶向下呢，还是自底往上，抑或采用分而治之、各个击破方法，这又涉及到聚焦网络的那些部分。

我建议在初期采用自底向上的方法，对于通常处在较低的层上的问题，比如因为线缆松掉或破损、或者配置了不正确的 IP 地址时，你无需浪费时间在检查应用上。在你有更多经验后，在处理某些故障现象时采用各个击破方法会更为快速。在从底层往上处理问题时，你大概会做下面这些事情：

第一层 -- 所有线缆都恰当地插入到端口了吗? 还是有的松掉了？ 网线头已经弯掉或是磨损了吗？如果网线有问题，设备上的指示灯会呈黄色，而非正常的绿色。是有人没有往接口上配置正确的速率吗？以太网端口速率有被设置正确吗？接口有开放给网络管理员以使用吗？

第二层 -- 接口有采用正确的协议，比如 Ethernet/PPP/HDLC, 以便能够与另一端保持一致吗？

第三层 -- 接口有使用正确的 IP 地址以及子网掩码？

第四层 -- 有使用正确的路由协议吗？从路由器通告的网络是正确的吗？

```

## TCP/IP、DoD 模型

TCP/IP 模型是另一个框架，作为 OSI 模型的替代。它是由 高级防务研究项目署（the Defense Advanced Research Projects Agency，DARPA）创建的四层或五层模型。它就是为人熟知的国防部模型。自顶向下的四层分别是：

```
4 - 应用, Application [Telnet/FTP/DNS/RIP]
3 - 传输/主机到主机，Transport/Host-to-Host [UDP/TCP/ICMP]
2 - 互联网/网际网络, Internet or Internetwork [IPSec/IP]
1 - 链路/网络接口，Link/Network Interface [Frame Relay/Ethernet/ATM]
```

TCP/IP 模型已由四层更新为五层，所以你会在考试中被问到有关五层 TCP 模型（a five-layered TCP model）的问题。较高的层离用户较近，而较低的层描述了其它系统交互时所采用的技术或协议。五层 TCP 模型如下所示：

```
5 - 应用, Application [Telnet/FTP/DNS/RIP]
4 - 传输/主机到主机，Transport/Host-to-Host [UDP/TCP/ICMP]
3 - 网络层，Network [IPSec/IP]
2 - 数据链路层，Data Link [Ethernet/Frame Relay/PPP]
1 - 链路/网络接口/物理，Link/Network Interface/Physical [Bits on the wire]
```

五层的 TCP 模型具有更细的粒度，能更精确地表示数据放在线路之前所发生的事情。比如在第二层处，进行了数据封装以及寻址（如数据链路寻址）。考试中思科偏向选择五层模型。

数据会如同上述的 OSI 模型那样在自应用层往物理层的途中进行封装，如表 所示：

| 应用，Application   | 仍未封装的数据，                                             |                                  |
| ------------------- | ------------------------------------------------------------ | -------------------------------- |
| 传输，Transport     | 将 TCP 头部添加到数据上，TCP header added to the data        | **段**，Segment                  |
| 网络，Network       | IP 头部被添加上去（包括 IP 地址）, IP header added(including IP address) | **包**，Packet                   |
| 数据链路，Data Link | 添加数据链路头部（数据链路地址）, Data Link header added(Data Link address) | **帧**，Frame                    |
| 物理，Physical      | 转变成电信号, Turned into electrical signals                 | 线路上的**位**，Bits on the wire |

你可能会被问及 TCP/IP 模型与 OSI 模型的对应关系。如表 所示：

| 层号，Layer # | OSI 模型            | TCP 模型                    |
| ------------- | ------------------- | --------------------------- |
| 7             | 应用, Application   | 应用, Application           |
| 6             | 表示, Presentation  | 应用, Application           |
| 5             | 会话, Session       | 应用, Application           |
| 4             | 传输, Transport     | 主机到主机, Host to Host    |
| 3             | 网络, Network       | 网际网络, Internetwork      |
| 2             | 数据链路, Data Link | 网络接口, Network Interface |
| 1             | 物理, Physical      | 网络接口, Network Interface |



# 1.总述===1

1. 中继链路

2. 动态中继协议

3. 原生vlan

4. vlan之间路由

5. vtp虚拟局域网中继协议

6. 故障排查：

   ```
   VLAN 故障排除基础， Basic VLAN Troubleshooting
   VLANs 是一种相当直观的交换机特性，它很少需要进行故障排除。你所发现的问题，大部分都是人为配置错误。在第 15 天的课程中，我们会详细讲到二层故障排除。而一些常见的涉及 VLAN 的问题有这些。
   
   VLAN 间路由无效，Inter-VLAN routing not working: 检查交换机之间的链路、路由器都是正确设置的，以及相关的 VLANs 允许通过且未被修剪（参照 “VTP 修剪” 部分）。show interface trunk 命令将提供所需信息。还要检查路由器子接口有配置了正确的封方式和 VLAN，同时子接口的 IP 地址是那些主机的默认网关。
   无法创建 VLANs， VLANs cannot be created: 检查交换机的 VTP 模式是否被设置成了 “client”。在 VTP 模式为 “client” 时，是不能创建 VLANs 的。另一个重要原因是交换机所允许的 VLANs 编号。show vtp status 命令将提供所需的信息（参看下的“中继和 VTP 故障排除”部分）。
   同一 VLAN 中的主机之间不能通信，Hosts within the same VLAN cannot reach each other: 重要的是某 VLAN 中的主机都要有一个属于同一子网的 IP 地址。如子网不同，它们之间就无法通信。另一个需要考虑的原因是这些主机是否都是连接到同一台交换机上。如它们不是连接到同一交换机，就要确保交换机之间的中继链路工作正常，还要确保该 VLAN 未在允许清单中被排除/被修剪[ensure that the trunk links(s) between the switches is/are working correctly and that the VLAN is not excluded/not pruned from the allowed list]。show interface trunk 命令将给出有关该中继链路的所需信息。
   中继和 VTP 故障排除，Troubleshooting Trunking and VTP
   下面是一些问题实例机器可能的解决方法。
   
   中继宕掉？
   接口务必要是 up/up
   中继链路两端的封装方式要匹配
   SwitchA#show interface fa1/1 switchport
   Name: Fa1/1
   Switchport: Enabled
   Administrative Mode: trunk
   Operational Mode: trunk
   Administrative Trunking Encapsulation: dot1q
   Operational Trunking Encapsulation: dot1q
   Negotiation of Trunking: Disabled
   Access Mode VLAN: 0 ((Inactive))
   VLAN 信息未有传输
   该 VLAN 在中继链路上阻塞了吗
   Switch#show interface trunk
   
   VTP 信息无法到达 VTP 客户端
   VTP 域名称密码正确吗？
   show vtp status / show vtp password
   
   在增加一台新的交换机后，所有 VTP 信息都变动了
   
   总是客户端模式加入新的交换机（但请查看上面的有关“配置修订号（the configuration revision number）”的提示）
   服务器模式将通告新信息
   VTP 修剪无效
   
   中间是否有一台透明交换机？
   该 VLAN 允许通过该中继链路？
   VLAN 间路由故障排除， Troubleshooting Inter-VLAN Routing
   VLAN 间路由故障可以多种形式出现，尤其是考虑在该过程中涉及多种设备（交换机、路由器等）。通过下面给出的适当故障排除方法论，你就能够将问题孤立在某台特定设备上，接着再其对应到一个错误配置的具体特性。
   
   从连通性立足点上看，下面这些情事都应该检查一下。
   
   检查一下终端主机连接了正确的交换机端口
   检查一下正确的交换机端口连接了正确的路由器端口（如使用了一台路由器做 VLAN 间路由）
   检查一下在此过程中所涉及到的每个端口承载的是正确的 VLANs
   连接终端站的那些端口，通常是被分配到一个特定 VLAN 的接入端口
   而将交换机连接至路由器的那些端口，则通常是中继端口
   在确认设备之间的连通性无误后，逻辑上下一步就是检查二层配置了，以所配置的中继端口上的封装方式开始, 这通常是作为首选的 802.1Q 封装方式。接着就要确保中继链路两端都是配置了同样的封装方式。
   
   可用于查看封类型的一些命令有以下这些。
   
   show interface trunk
   show interface <number> switchport
   这里有个输出示例。
   
   Cat-3550-1#show interfaces trunk
   Port        Mode        Encapsulation       Status      Native vlan
   Fa0/1       on          802.1q              trunking    1
   Fa0/2       on          802.1q              trunking    1
   Port        Vlans allowed on trunk
   Fa0/1       1,10,20,30,40,50
   Fa0/2       1-99,201-4094
   命令 show interface trunk 提供的另一重要细节是中继状态。从中继状态可以看出中继是否形成，同时在链路两端都要检查中继状态。如果接口未处于“中继”模式，那么接口的运行模式（on, auto, 等）是最重要的检查项，以弄清接口能否允许与链路另一端形成中继态（a trunking state）。
   
   中继端口上另外一个需要检查的重要元素便是原生 VLAN。原生 VLAN 错误配置可能带来功能缺失，抑或安全问题。中继链路的两端的原生 VLAN 需要匹配。
   
   假如在完成二层检查任务后，VLAN 间路由问题仍然存在，你就可以继续进行三层配置检查了。依据用于实现 VLAN 间路由的三层设备，可能会在下列设备上进行配置及配置检查。
   
   多层交换机，multilayer switch
   路由器 -- 物理接口， router -- physical interfaces
   路由器 -- 子接口，router -- subinterfaces
   三层设备上应该检查一下其各接口（或者交换机虚拟接口，SVI）都有分配的正确的子网，同时如有必要，你还应检查一下路由协议。通常情况下，各个 VLAN 都有分配不同的子网，所以你应确保你未曾错误配置了接口。而为检查此项，你可以对特定物理接口、子接口或是 SVI，使用 show interface 命令。
   ```

   # 2.总述===2

   安全相关

   1. 物理访问防护

   2. 访问台访问

      ```
      控制台访问
      控制台接口是设计用于提供到路由器的物理访问的，以完成路由器的初始设置及灾难恢复。任何能取得控制台访问的人，都能够完全擦出或是重新配置这些文件，因此，控制台接口应有一个口令进行保护，可以简单地添加一个口令，也可以为其添加一个本地用户名和口令，如下面所示。
      
      只添加一个口令即可
      Router(config)#line console 0
      Router(config-line)#password cisco
      Router(config-line)#login
      为控制台添加一个本地用户名和口令组合
      
      Router(config)#username paul password cisco
      Router(config)#line console 0
      Router(config-line)#login local
      你还可以为控制台（以及虚拟终端）线路创建一个超时值，如此就可以在确定的时间过后断开连接。默认的超时是5分钟。
      
      Router(config)#line console 0
      Router(config-line)#exec-timeout ?
          <0-35791>   Timeout in minutes
      Router(config-line)#exec-timeout 2 ?
          <0-2147483> Timeout in seconds
          <cr>
      Router(config-line)#exec-timeout 2 30
      Router(config-line)#
      ```

      

   3. [远程登陆访问，Telnet Access](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#远程登陆访问telnet-access)

      ```
      在某人给远程登陆或者说虚拟终端线路添加了口令之前，你实际上是不能远程登陆进一台路由器的。同样，你可以给虚拟终端线路添加一个口令，或是告诉路由器去查找一个本地用户名及口令组合（该组合可以在配置文件中，或是存储在一台 RADIUS/TACACS 服务器上），如下面所示。
      
      Router(config-line)#line vty 0 15
      Router(config-line)#password cisco
      Router(config-line)#login   ← or login local
      下面的输出是自某台路由器到另一台的远程登陆会话。当你获得远程登陆访问时，你可以看到主机名发生了改变。注意在你输入口令时，它看不到。
      
      Router1#telnet 192.168.1.2
      Trying 192.168.1.2 ...Open
      User Access Verification
      Username: paul
      Password:
      Router2>
      而如你有一个安全版 IOS 镜像，则可以将路由器配置为仅允许安全壳访问，而不是远程登陆访问。这样做的好处在于所有数据都是加密了的。如你在启用安全壳后，再次使用远程登时，连接将被终止。
      
      Router1(config)#line vty 0 15
      Router1(config-line)#transport input ssh
      Router2#telnet 192.168.1.2
      Trying 192.168.1.2 ...Open
      [Connection to 192.168.1.2 closed by foreign host]
      ```

   4. [使能模式保护，Protecting Enable Mode](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#使能模式保护protecting-enable-mode)

      ```
      使能模式（enable mode）取得路由器的配置访问，因此你会想要保护该模式。你可以配置一个使能秘密（an enable secret）或使能口令（an enable password）。实际上，使能秘密和使能口令是可以同时有的，但这是一个坏主意。
      
      使能口令是未加密的，所以在路由器配置中可以看到。而使能秘密有 5 级加密(level 5 encryption, MD5)，难于破解。自 15.0(1）S 后的较新 IOS 版本中，还可以使用比 MD5 加密高级的 4 级加密（level 4 encryption, SHA256）, 5 级加密最终会不赞成使用。你可以给使能口令加上命令 service password-encryption, 但因为此方式使用 7 级加密(level 7 encryption, 比如，低安全性；思科称其为“背后安全性，over the shoulder security”, 因其仅需某人从你背后偷看并记住一个稍难的词组，便可以用网上的 7 级口令解密工具予以破解)，而很容易被破解。下面的输出中可以看到 7 级与 5 级加密文本。
      
      Router(config)#enable password cisco
      Router(config)#exit
      Router#show run
      enable password cisco
      Router(config)#enable password cisco
      Router(config)#service password-encryption
      Router#show run
      enable password 7 0822455D0A16
      Router(config)#enable secret cisco
      Router(config)#exit
      Router#show run
      enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
      记住如你忘记了使能口令，你将不得不对路由器或交换机进行一下口令恢复操作。请用 Google 搜索你所使用的型号，因为型号不同其口令恢复过程也不一样。对于路由器来说，涉及
      
      设备重启，以及
      在重启过程中按下指定的中断键盘按键
      再设置配置寄存器（the configuration register）以跳过启动配置文件（通常将配置寄存器设置为 0x2142）
      接着要执行一个 copy start-config running-config 命令
      此时，就可以创建新的口令了。
      
      而对交换机来说，口令恢复过程会有一点复杂（请再次用 Google 搜索你用到的具体交换机型号），但也可以通过一个小把戏实现口令恢复 -- 在给交换机上电时，按住 MODE 按钮8秒钟。交换机将以空白配置启动，而上一次的启动配置(the last startup configuration)将保存在 flash 中的 config.text.renamed 文件里头，所以该文件可复制用于运行配置(running configuration)，然后用其它口令对其进行修改。
      ```

      

   5. [用户访问防护，Protecting User Access](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#用户访问防护protecting-user-access)

      ```
      思科 IOS 提供对用户的单独用户名及口令，同时对所能够使用的命令进行清单限制的能力。这在分层次网络支持时是有用的。下列输出中给出了一个示例。
      
      RouterA#config term
      Enter configuration commands, one per line. End with CNTL/Z.
      RouterA(config)#username paul password cisco
      RouterA(config)#username stuart password hello
      RouterA(config)#username davie password football
      RouterA(config)#line vty 0 4
      RouterA(config-line)#login local
      RouterA(config-line)#exit
      RouterA(config)#exit
      你可在路由器上指派不同用户帐号的访问级别。比如，你也许打算那些初级网络团队成员仅能使用一些基本的故障排除命。你还有必要记住思科路由器有口令安全的两种模式（two modes of password security），用户模式（Exec mode）和特权模式（Enable mode）。
      
      思科路由器有可供配置的 16 种（0 到 15）不同特权级别，其中 15 级是完全的访问权限，如下所示。
      
      RouterA#conf t
      Enter configuration commands, one per line. End with CNTL/Z.
      RouterA(config)#username support privilege 4 password soccer
          LINE Initial keywords of the command to modify
      RouterA(config)#privilege exec level 4 ping
      RouterA(config)#privilege exec level 4 traceroute
      RouterA(config)#privilege exec level 4 show ip interface brief
      RouterA(config)#line console 0
      RouterA(config-line)#password basketball
      RouterA(config-line)#login local ←  password is needed
      RouterA(config-line)#^z
      支持那人在登入到路由器并尝试进入配置模式时，此命令及其它命令将不可用且无效，也不能看到。
      
      RouterA con0 is now available
      Press RETURN to get started.
      User Access Verification
      Username: support
      Password:
      RouterA#config t ←  not allowed to use this
                  ^
      % Invalid input detected at ‘^’ marker.
      你可在路由器提示符下查看默认的不同特权级别(the default privilege levels)。
      
      
      Router>show privilege
      Current privilege level is 1
      Router>en
      Router#show priv
      Router#show privilege
      Current privilege level is 15
      Router#
      ```

      

   6. [更新 IOS， updating the IOS](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#更新-ios-updating-the-ios)

      ```
      公认地，更新 IOS 有时会将漏洞或故障引入你的网络中，因此，如你有与思科公司有个技术支持合同（a TAC contract, Technical Assistance Centre, TAC), 那么最好的做法就是依据思科公司的建议来做。一般来讲，保持 IOS 版本最新是高度推荐的做法。藉由更新 IOS， 你能得到下面这些好处。
      
      修正已知的软件缺陷，fixed known bugs
      解决安全隐患，cloese security vulnerabilities
      提供特性强化及 IOS 能力提升，Offers enhanced features and IOS capabilities
      ```

      

   7. [路由器日志记录，Router Logging](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#路由器日志记录router-logging)

      ```
      路由器提供事件记录的能力。它们可将日志消息照你的意愿，发送到屏幕或某台服务器。你应该记录路由器消息，而又有8个可用的日志记录严重程度级别（考试要求你知道这些不同的级别），如下面输出中的粗体字所示。
      
      logging buffered ?
      `<0-7>`Logging severity level
      alerts—Immediate action needed (severity=1)
      critical—Critical conditions (severity=2)
      debugging—Debugging messages (severity=7)
      emergencies—System is unusable (severity=0)
      errors—Error conditions (severity=3)
      informational—Informational messages (severity=6)
      notifications—Normal but significant conditions (severity=5)
      warnings—Warning conditions (severity=4)
      而你有可以将这些日志消息发往几个不同的地方。
      
      Router(config)#logging ?
          A.B.C.D     IP address of the logging host
          buffered    Set buffered logging parameters
          console     Set console logging parameters
          host        Set syslog server IP address and parameters
          on          Enable logging to all enabled destinations
          trap        Set syslog server logging level
          userinfo    Enable logging of user info on privileged mode enabling
      日志消息通常会在你经由控制台进入到路由器时，显示在屏幕上。而这可能会在你敲入配置命令时多少有些烦人。这里就有个在我输入一个命令（加了下划线的那条）时，被一条控制台日志消息(a console logging message)给中断了的例子。
      
      Router(config)#int f0/1
      Router(config-if)#no shut
      Router(config-if)#end
      Router#
      *Jun 27 02:06:59.951: %SYS-5-CONFIG_I: Configured from console by console <u>show ver</u>
      *Jun 27 02:07:01.151: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
      此时你既可以用命令 no logging console 关闭日志消息输出，也可以用 logging synchronous 命令将它们设置为无中断（not interrupt）， logging synchronous 命令会重新输入在被日志消息中断之前，你所输入的那行命令。logging synchronous 命令在虚拟终端线路上也是可用的。
      
      Router(config)#line con 0
      Router(config-line)#logging synchronous
      Router(config-line)#
      Router(config-line)#exit
      Router(config)#int f0/1
      Router(config-if)#shut
      Router(config-if)#exit
      Router(config)#
      *Jun 27 02:12:46.143: %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to
      administratively down
      Router(config)#exit
      这里值得一提的是，在你经由 Telnet (或 SSH) 进入到路由器时，你是不会看到控制台输的。如你想在此时看到日志消息，执行 terminal monitor 命令即可。
      ```

      

   8. [简单网络管理协议，Simple Network Management Protocol, SNMP](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#简单网络管理协议simple-network-management-protocol-snmp)

      ```
      SNMP 是一种可用于远程管理网络的服务。它由一台网络管理员维护、运行了 SNMP 管理软件的中心工作站，及包括路由器、交换机及服务器等的，各台网络设备上的小文件（代理，agents）构成。
      
      包括 HP、Cisco、IBM 及 SolarWinds 等的几家厂商，都有设计 SNMP 软件。也有很多开发源代码版本的 SNMP 软件可用。这类软件允许你监测设备的带宽及活动情况，比如登陆活动以及端口状态等。
      
      运用 SNMP， 你可以远程地配置或是关闭端口和设备。你也可以将其配置在某些条件触发时，诸如出现高带宽或是端口宕掉时，发出警告消息。我们会在第 40 天来讲 SNMP 的细节，因为 SNMP 是 ICND2 大纲的部分。
      ```

   9. [加固交换机，Securing the Switch](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#加固交换机securing-the-switch)

      ```
      阻止远程登陆访问，Prevent Telnet Access
      远程登陆流量以明文方式发送口令，这就是说，可轻易地在配置中读取口令，或是有人接到你的网络上，那么就能通过网络嗅探软件查看到口令。
      
      默认情况下，远程登陆实际上是关闭的（也就是说，你需要为其设置一个口令，也可选择设置一个用户名，来让其工作）。不过，如你仍想要有对管理端口的远程访问的话，你可使用命令 transport input ssh, 开启到交换机的 SSH 通信，这已在前面讨论过了。
      
      Farai 说 -- “所有虚拟终端线路下，命令 transport input all 是默认开启的，而其它线路的 transport input none 命令是默认开启的。”
      ```

   10. [开启 SSH， Enable SSH](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#开启-ssh-enable-ssh)

       ```
       尽可能地采用 SSH 而不是 Telnet 及 SNMP 来访问你的交换机。SSH 表示安全壳(secure shell), 令到某网络上的两台设备之间信息的安全交换。SSH 采用公钥加密法（pubic-key cryptography）来认证连接设备。Telnet 及 SNMP 版本 1 和 2 都是未加密的，易受包嗅探（packet sniffing）的影响， SNMP 版本 3 提供了保密性 -- 数据包有加密以防止恶意源窃取数据（snooping by an unauthorised source）。
       
       要开启 SSH， 你需要有一个支持加密的 IOS 版本。一种快速找出 IOS 镜像是否支持加密的方法是执 show version 命令。查找镜像文件名中有无 k9 字样，或者在思科系统公司的安全性声明中查找有关字句。
       
       Switch#sh version
       Cisco IOS Software, C3560 Software (C3560-ADVIPSERVICES K9-M), Version
       12.2(35)SE1, RELEASE SOFTWARE (fc1)
       Copyright (c) 1986-2006 by Cisco Systems, Inc.
       Compiled Tue 19-Dec-06 10:54 by antonio
       Image text-base: 0x00003000, data-base: 0x01362CA0
       ROM: Bootstrap program is C3560 boot loader
       BOOTLDR: C3560 Boot Loader (C3560-HBOOT-M) Version 12.2(25r)SEC, RELEASE
       SOFTWARE (fc4)
       Switch uptime is 1 hour, 8 minutes
       System returned to ROM by power-on
       
       System image file is “flash:/c3560-advipservicesk9-mz.122-35.SE1.bin”
       
       This product contains cryptographic features and is subject to United States and local
       country laws governing import, export, transfer and use. Delivery of Cisco cryptographic
       products does not imply third-party authority to import, export, distribute or use
       encryption. Importers, exporters, distributors and users are responsible for compliance
       with U.S. and local country laws. By using this product you agree to comply with
       applicable laws and regulations. If you are unable to comply with U.S. and local laws,
       return this product immediately. A summary of U.S. laws governing Cisco cryptographic
       products may be found at:
       http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
       If you require further assistance please contact us by sending email to export@cisco.com.
       --More-
       注意: 如你没有带有安全特性版本的 IOS，你就必须为此付费购买。
       
       为建立加密连接，你需要在交换机上创建一对公钥和私钥（a private/public key, 见下面）。在连接时，你这边使用公钥加密数据，交换机将会使用它的私钥来解密数据。而在认证时，使用你所选择的用户名/口令组合。下一个问题是，要设置交换机的主机名和域名（hostname and domain name）, 因为在创建公钥/私钥对时，会用到主机名.域名命名法（hostname.domainname nomenclature）。显然，在命名主机名和域名时，将其命名为能够代表系统的有意义名字，是好的做法。
       
       首先，你要给交换机一个与默认主机名 Switch 不一样的主机名。接着，添加其域名（该域名通常与 Windows 活动目录的 FQDN 一致）。这时就可以创建用于秘密的密钥（the crypto key）了。系数/模量（the modulus） 是指你所希望使用的密钥的长度，取值范围是 360 到 2048, 后者具有最高的安全性；高于 1024 位的模量就认为是安全的了。此时，交换机上的 SSH 就已经开启了。
       
       有一些 SSH 相关的维护命令需要输入。ip ssh time-out 60 命令会将任何空闲 60 秒的 SSH 连接置为超时。而命令 ip ssh authentication-retries 2 则会在认证失败两次的 SSH 连接重置为初始状态。此设置并不会阻止用户建立新的连接并重试认证。设置过程如下所示。
       
       Switch(config)#hostname SwitchOne
       SwitchOne(config)#ip domain-name mydomain.com
       SwitchOne(config)#crypto key generate rsa
       Enter modulus: 1024
       SwitchOne(config)#ip ssh time-out 60
       SwitchOne(config)#ip ssh authentication-retries 2
       可使用命令 ip ssh version 2 开启 SSH 版本2。让我们看看其中一个密钥。在这个实例中，该密钥是为 HTTPS 生成的。因为其是在开启 HTTPS 时自动生成的，所以其名称也会自动产生。
       
       firewall#show crypto key mypubkey rsa
       Key name: HTTPS_SS_CERT_KEYPAIR.server
       Temporary key
       Usage: Encryption Key
       Key is not exportable.
       Key Data:
       306C300D 06092A86 4886F70D 01010105 00035B00 30580251 00C41B63 8EF294A1
       DC0F7378 7EF410F6 6254750F 475DAD71 4E1CD15E 1D9086A8 BD175433 1302F403
       2FD22F82 C311769F 9C75B7D2 1E50D315 EFA0E940 DF44AD5A F717BF17 A3CEDBE1
       A6A2D601 45F313B6 6B020301 0001
       要验证交换机上的 SSH 开启，输入以下命令。
       
       Switch#show ip ssh
       SSH Enabled - version 1.99
       Authentication timeout: 120 secs; Authentication retries: 2
       Switch#
       而用一个简单的命令，就可以关闭 HTTP 访问。
       
       Switch(config)#no ip http server
       查看交换机上 HTTP 服务器的状态。
       
       Switch#show ip http server status
       HTTP server status: Disabled
       HTTP server port: 80
       HTTP server authentication method: enable
       HTTP server access class: 0
       HTTP server base path: flash:html
       Maximum number of concurrent server connections allowed: 16
       Server idle time-out: 180 secondsServer life time-out: 180 seconds
       Maximum number of requests allowed on a connection: 25
       HTTP server active session modules: ALL
       HTTP secure server capability: Present
       HTTP secure server status: Enabled
       HTTP secure server port: 443
       HTTP secure server ciphersuite: 3des-ede-cbc-sha des-cbc-sha rc4-128-md5 rc4-12
       HTTP secure server client authentication: Disabled
       HTTP secure server trustpoint:
       HTTP secure server active session modules: ALL
       还可以在 VTY 线路上应用控制列表（an access control list, ACL）。在第9天的课程将会讲到。
       
       设置使能秘密口令，Set an Enable Secret Password
       全局配置模式允许用户对交换机或路由器进行配置，还可以擦除配置，以及重置口令。你务必要设置一个口令或秘密口令来保护此模式，而这实际上是为阻止用户闯过（get past）用户模式。一般口令在路由器配置文件中会显示出来，而 enable secret 口令则会进行加密。
       
       上面已经提到，你实际上可以在交换机或路由器上同时设置使能口令（a password）和使能秘密口令（enable secret password）,但这会带来混乱。所以请只设置使能秘密口令就好。下面的配置文件演示了通过在命令前键入 do 关键字，而无需回到特权模式，就可执行该命令的情形。
       
       Switch1(config)#enable password cisco
       Switch1(config)#do show run
       Building configuration...
       Current configuration: 1144 bytes
       hostname Switch1
       enable password cisco
       Farai 补充道 -- “你可以使用 service password-encryption 命令，对使能口令 enable password 进行 7 级加密。”
       
       通过在命令前加上 no 关键字后再次执行该命令，可以擦除配置文件中的大多数行。上面 Farai 提到的使用 service password-encryption 命令是毫无作用的，因为这个方法仅提供了弱加密（7 级）， 而下面的秘密口令（the secret password）则有着强加密（MD5）。
       
       
       Switch1(config)#no enable password
       Switch1(config)#enable secret cisco
       Switch1(config)#do show run
       Building configuration...
       Current configuration: 1169 bytes
       hostname Switch1
       enable secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0 [strong level 5 password]
       ```

   11. [服务，Services](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#服务services)

       ```
       你总是应该关闭那些你不会用到的服务。思科已经在关闭那些不安全和很少用到的服务和协议上做得很好了；尽管如此，你可能会要因明确这点而亲自关闭它们。同样也会有一些服务是有帮助的。多数服务可在全局配置模式中的 service 命令下找到。
       
       Switch(config)# service ?
       compress-config         Compress the configuration file
       config                  TFTP load config files
       counters                Control aging of interface counters
       dhcp                    Enable DHCP server and relay agent
       disable-ip-fast-frag    Disable IP particle-based fast fragmentation
       exec-callback           Enable EXEC callback
       exec-wait               Delay EXEC startup on noisy lines
       finger                  Allow responses to finger requests
       hide-telnet-addresses   Hide destination addresses in telnet command
       linenumber              enable line number banner for each exec
       nagle                   Enable Nagle’s congestion control algorithm
       old-slip-prompts        Allow old scripts to operate with slip/ppp
       pad                     Enable PAD commands
       password-encryption     Encrypt system passwords
       password-recovery       Disable password recovery
       prompt                  Enable mode specific prompt
       pt-vty-logging          Log significant VTY-Async events
       sequence-numbers        Stamp logger messages with a sequence number
       slave-log               Enable log capability of slave IPs
       tcp-keepalives-in       Generate keepalives on idle incoming network
           connections
       tcp-keepalives-out      Generate keepalives on idle outgoing network
           connections
       tcp-small-servers       Enable small TCP servers (e.g., ECHO)
       telnet-zeroidle         Set TCP window 0 when connection is idle
       timestamps              Timestamp debug/log messages
       udp-small-servers       Enable small UDP servers (e.g., ECHO)
       一般来讲，有下列的这些最常见的要开启或关闭的服务。其各自的说明在中括号里。
       
       no service pad [数据包组装程序/分拆程序，在异步组网中有使用；很少使用到]
       no service config [阻止交换机从网络获取其配置文件]
       no service finger [关闭 finger 服务器；很少用到]
       no ip icmp redirect [组织 ICMP 重定向，而 ICMP 重定向可被用于路由器投毒]
       no ip finger [关闭 finger 服务的另一种方式]
       no ip gratuitous-arps [关闭此服务以阻止中间人攻击（man-in-the-middle attacks）]
       no ip source-route [关闭由用户提供到目的地的逐跳路由(user-provided hop-by-hop routing to destination)]
       service sequence-numbers [在每条日志记录中，分配给其一个编号，同时此编号序列增加]
       service tcp-keepalive-in [防止路由器将挂起的管理会话一直保持开启，prevents the router from keeping hung management sessions open]
       service tcp-keepalive-out [与 sevice tcp-keepalive-in 功能一样]
       no service upp-small-servers [关闭 echo, chargen, discard, daytime 等功能，这些功能很少用到]
       no service tcp-small-servers [关闭 echo, chargen, discard 等功能，这些功能很少用到]
       service timestamps debug datetime localtime show-timezone [在调试模式下（in debug mode）, 将每个记录的数据包，使用本地时间，打上日期和时间的时间戳，并显示时区]
       service timestamps log datetime localtime show-timezone [在非调试模式下（not in debug mode）, 将每个记录的数据包，使用本地时间，打上日期和时间的时间戳，并显示时区 -- 这服务在查看日志文件非常有用，尤其是在时钟设置正确的情况下]
       ```

   12. [修改原生 VLAN， Change the Native VLAN](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#修改原生-vlan-change-the-native-vlan)

       ```
       交换机使用原生 VLAN 来承载那些特定的协议流量，诸如思科发现协议（Cisco Discovery Protocol, CDP）、VLAN 中继协议（VLAN Trunking Protocol, VTP）、端口聚合协议（Port Aggregation Protocol, PAgP），以及动态中继协议（Dynamic Trunking Protocol, DTP）等协议信息。默认原生 VLAN 总是 VLAN 1; 但原生 VLAN 是可以手动设置为任何有效 VLAN 编号（除开 0 和 4096, 因为这些 VLAN 编号处于 VLANs 的保留范围）。
       
       你可以使用下面输出中演示的命令（在每个接口下执行的），来查看原生 VLAN。
       
       Switch#show interfaces FastEthernet0/1 switchport
       Name: Fa0/1
       Switchport: Enabled
       Administrative Mode: trunk
       Operational Mode: trunk
       Administrative Trunking Encapsulation: dot1q
       Operational Trunking Encapsulation: dot1q
       Negotiation of Trunking: On
       Access Mode VLAN: 1 (default)
       Trunking Native Mode VLAN: 1 (default)
       Voice VLAN: none
       将端口放入 VLAN 1 被认为是一种安全漏洞（a security vulnerability）, 允许黑客取得网络资源的访问。为减轻此问题，避免任何主机放入 VLAN 1 是一种明智可取的做法。同时也可将所有中继接口上的原生 VLAN 修改为某个未使用的 VLAN。
       
       Switch(config-if)#switchport trunk native vlan 888
       
       注意： 这是 CCNA 大纲中的一个关键目标（one of the key objectives）, 所以务必牢记。
       
       你还可以用下面的命令，来阻止原生 VLAN 上的数据通过中继链路。
       
       Switch(config-if)#switchport trunk allowed vlan remove 888
       ```

   13. [修改管理 VLAN, Change the Management VLAN](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#修改管理-vlan-change-the-management-vlan)

       ```
       给交换机配置一个 IP 地址，以实现为管理目的而远程登陆到其上，也是可以的。这又叫做交换机虚拟接口（Switch Virtual Interface, SVI）。将该管理访问做到除 VLAN 1 之外的其它 VLAN 上，是一种明智的预防措施，如下面的输出所示。
       
       
       Switch(config)#vlan 3
       Switch(config-vlan)#interface vlan3
       %LINK-5-CHANGED: Interface Vlan3, changed state to up
       Switch(config-if)#ip address 192.168.1.1 255.255.255.0
       ```

   14. [关闭 CDP, Turn Off CDP](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#关闭-cdp-turn-off-cdp)

       ```
       后面会讲到思科发现协议（Cisco Discovery Protocol, CDP）, 但在这里，你要知道，在大多数的路由器和交换机上的每个接口下，该协议都是打开的，这也是通行的做法，其功能是发现路由器或交换机上连接的思科设备。你可能不打算让其它思科设备看到你的网络设备的信息，那么就可以关掉这个服务，至少应该在那些你的网络边缘上的，连接其它公司或者 ISP 的那些设备上关闭 CDP。
       
       Farai 指出 -- “CDP 在比如 ASR 路由器的所有平台上默认都未开启。”
       
       在下面的输出中，你能看到一台连接我的交换机的路由器，在我执行 show cdp neighbor detail 命令时，其能看见哪些基本信息。
       
       Router#show cdp neighbor detail
       Device ID: Switch1
       Entry address(es):
       Platform: Cisco 2960, Capabilities: Switch
       Interface: FastEthernet0/0, Port ID (outgoing port): FastEthernet0/2
       Holdtime: 176
       Version :
       Cisco Internetwork Operating System Software
       IOS (tm) C2960 Software (C2960-I6Q4L2-M), Version 12.1(22)EA4, RELEASE SOFTWARE(fc1)
       Copyright (c) 1986-2005 by Cisco Systems, Inc.
       Compiled Wed 18-May-05 22:31 by jharirba
       advertisement version: 2
       Duplex: full
       Router#
       下面的命令将对整个设备关闭 CDP。
       
       
       Switch1(config)#no cdp run
       而要对某个特定接口关闭 CDP， 执行以下命令。
       
       Switch1(config)#int FastEthernet0/2
       Switch1(config-if)#no cdp enable
       ```

   15. [添加横幅消息，Add a Banner Message](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#添加横幅消息add-a-banner-message)

       ```
       横幅消息将于某用户登入路由器或交换机时显示出来。其并不会提供任何实质性的安全，但会显示你设置的警告信息。在下面的配置中，我选择的是 “Y” 字母作为界定符（delimiting character）, 界定符用以告诉路由器，我已输完消息文字。
       
       Switch1(config)#banner motd Y
       Enter TEXT message. End with the character ‘Y’.
       KEEP OUT OR YOU WILL REGRET IT Y
       Switch1(config)#
       在我从交换机登入到路由器时，我能看到横幅消息。错在选择了 “Y” 作为界定符，因为它割除了我的消息文字。
       
       Router#telnet 192.168.1.3
       Trying 192.168.1.3 ...Open
       KEEP OUT OR
       横幅消息可以是以下这些。
       
       在用户看到登陆提示符之前显示出来 -- MOTD（message of the day）
       在用户看到登陆提示符之前显示出来 -- Login
       在登陆提示符之后显示给用户 -- Exec （在你打算对未授权用户隐藏的信息）
       在本书中，横幅消息作为一些实验的组成部分。我建议你掌握全部三种类型横幅消息，并以登入路由器的方式来测试它们。依据你所用的平台和 IOS，会有不同的选择。
       
       
       Router(config)#banner ?
           LINE                c banner-text c, where ‘c’ is a delimiting character
           exec                Set EXEC process creation banner
           incoming            Set incoming terminal line banner
           login               Set login banner
           motd                Set Message of the Day banner
           prompt-timeout      Set Message for login authentication timeout
           slip-ppp            Set Message for SLIP/PPP
       ```

       ```
       说实话这书的翻译太烂了。什么安全壳
       What is the banner message?
       Banner Message
       Banner messages are responses that are displayed to the user on top of the chat window/screen. A banner can be shown as a response for the following actions: Executing a command. Performing an action on a message (Message Action)
       ```

   16. [设置 VTP 口令， Set a VTP Password](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#设置-vtp-口令-set-a-vtp-password)

       ```
       VTP 确保网络上交换机之间传输的是精确的 VLAN 信息。而为了保护 VLAN 信息的更新，你应该在交换机上加入 VTP 口令（该 VTP 域中所有交换机上的 VTP 口令都应一致）， 如下面输出演示的那样。
       
       
       Switch1(config)#vtp domain 60days
       Changing VTP domain name from NULL to 60days
       Switch1(config)#vtp password cisco
       Setting device VLAN database password to cisco
       Switch1(config)#
       ```

​	17.[限定 VLAN 信息， Restrict VLAN Infaomation](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#限定-vlan-信息-restrict-vlan-infaomation)

```
默认下的交换机允许所有 VLANs 通过中继链路。你将其修改为指定 VLANs 才能通过中继链路。如下面的输出所示。


Switch1(config)#int FastEthernet0/4
Switch1(config-if)#switchport mode trunk
Switch1(config-if)#switchport trunk allowed vlan ?
    WORD        VLAN IDs of the allowed VLANs when this port is in trunking mode
    add         add VLANs to the current list
    all         all VLANs
    except      all VLANs except the following
    none        no VLANs
    remove      remove VLANs from the current list
Switch1(config-if)#switchport trunk allowed vlan 7-12
Switch1#show interface trunk
Port        Mode    Encapsulation   Status      Native vlan
Fa0/4       on      802.1q          trunking    1
Port        Vlans allowed on trunk
Fa0/4       7-12
```

### 18.[端口因出错关闭后的恢复功能，Error Disable Recovery](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#端口因出错关闭后的恢复功能error-disable-recovery)

```
默认下的交换机允许所有 VLANs 通过中继链路。你将其修改为指定 VLANs 才能通过中继链路。如下面的输出所示。


Switch1(config)#int FastEthernet0/4
Switch1(config-if)#switchport mode trunk
Switch1(config-if)#switchport trunk allowed vlan ?
    WORD        VLAN IDs of the allowed VLANs when this port is in trunking mode
    add         add VLANs to the current list
    all         all VLANs
    except      all VLANs except the following
    none        no VLANs
    remove      remove VLANs from the current list
Switch1(config-if)#switchport trunk allowed vlan 7-12
Switch1#show interface trunk
Port        Mode    Encapsulation   Status      Native vlan
Fa0/4       on      802.1q          trunking    1
Port        Vlans allowed on trunk
Fa0/4       7-12
```

### [限定 VLAN 信息， Restrict VLAN Infaomation](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#限定-vlan-信息-restrict-vlan-infaomation)

```
默认下的交换机允许所有 VLANs 通过中继链路。你将其修改为指定 VLANs 才能通过中继链路。如下面的输出所示。

Switch1(config)#int FastEthernet0/4
Switch1(config-if)#switchport mode trunk
Switch1(config-if)#switchport trunk allowed vlan ?
    WORD        VLAN IDs of the allowed VLANs when this port is in trunking mode
    add         add VLANs to the current list
    all         all VLANs
    except      all VLANs except the following
    none        no VLANs
    remove      remove VLANs from the current list
Switch1(config-if)#switchport trunk allowed vlan 7-12
Switch1#show interface trunk
Port        Mode    Encapsulation   Status      Native vlan
Fa0/4       on      802.1q          trunking    1
Port        Vlans allowed on trunk
Fa0/4       7-12
```

### [端口因出错关闭后的恢复功能，Error Disable Recovery](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#端口因出错关闭后的恢复功能error-disable-recovery)

```
由一系列的事件导致的，思科交换机将其端口置为一种特别的关闭模式（a special diabled mode）, 叫做出错关闭（err-disabled）。此特性简单来讲，由于在某个特定端口上发生某种错误后，该端口就被关闭了。错误可能有多种原因，之最常见的就是出现触发了某项端口安全策略（a port security policy）。在某个未授权用户尝试连接到某个交换机端口时，这是通常的做法，它阻止那些违规设备访问网络。

出错关闭端口(an err-disabled port）看起来会是这样的。

Switch# show interface f0/1
FastEthernet0/1 is down, line protocol is down [err-disabled]
.....
而为了重新使用（re-activate）某个出错关闭接口，以在该接口上执行 shutdown 及 no shutdown 命令的人工干预是必要的, 网络工程师们俗称此操作为端口弹跳(a bouncing the port)。但是，某些情形要求从原端口状态自动恢复过来，而不是等到管理员手动开启该端口。此出错关闭回复模式，通过将交换机配置为在依引发通信失败事件的不同，而不同的一段时间后，自动重新打开出错关闭端口的方式，来发挥作用。区分通信失败事件，提供了出错关闭恢复功能所监测事件上的粒度（granularity）控制。

完成该功能设置的命令是 errdisable recovery cause, 在全局路由器配置模式下输入。

Switch(config)#errdisable recovery cause ?
    all         Enable timer to recover from all causes
    bpduguard   Enable timer to recover from bpdu-guard error disable state
    dtp-flap    Enable timer to recover from dtp-flap error disable state
    link-flap   Enable timer to recover from link-flap error disable state
    pagp-flap   Enable timer to recover from pagp-flap error disable state
    rootguard   Enable timer to recover from root-guard error disable state
    udld        Enable timer to recover from udld error disable state
......
errdisable recovery cause 命令依设备型号会有所不同，但最常见的参数有这些。

all
arp-inspection
bpduguard
dhcp-rate-limit
link-flap
psecure-violation
security-violation
storm-control
udld
多数平台上端口自动恢复的默认时间是 300 秒，此时间可以用全局配置命令 errdisable recovery interval 手动修改。

Switch(config)#errdisable recovery interval ?
    <30-86400>  timer-interval(sec)
而命令 show errdisable recovery 命令则会提供有关出错关闭恢复功能（the err-disable recovery function）激活了的那些特性的细节信息，以及受到监测的接口，并包含了接口重新开启剩余时间。


Switch#show errdisable recovery
ErrDisable Reason           Timer Status
-----------------           --------------
arp-inspection              Disabled
bpduguard                   Disabled
channel-misconfig           Disabled
dhcp-rate-limit             Disabled
dtp-flap                    Disabled
gbic-invalid                Disabled
inline-power                Disabled
l2ptguard                   Disabled
link-flap                   Disabled
mac-limit                   Disabled
link-monitor-failure        Disabled
loopback                    Disabled
oam-remote-failure          Disabled
pagp-flap                   Disabled
port-mode-failure           Disabled
psecure-violation           Enabled
security-violation          Disabled
sfp-config-mismatch         Disabled
storm-control               Disabled
udld                        Disabled
unicast-flood               Disabled
vmps                        Disabled
Timer interval: 300 seconds
Interfaces that will be enabled at the next timeout:
Interface           Errdisable reason           Time left(sec)
---------           -----------------           --------------
Fa0/0               psecure-violation           193
```

### [外部认证方式，External Authentication Methods](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#外部认证方式external-authentication-methods)

```
与本地存储不同，你可以采用一台通常运行了 AAA 或 TACACS+ 的服务器来存储用户名和口令。这么做的优势在于，你无需在每台路由器和交换机上都手动输入用户名和口令。而是将其存储在服务器的数据库中。

TACACS+ 表示“加强版终端访问控制器访问控制系统（Terminal Access Controller Access Control System Plus, TACACS+）”。它是一个思科专有协议，使用 TCP 49 号端口。TACACS+ 提供了经由一台或多台 TACACS+ 中心服务器，对包含路由器及网络介入服务器等网络设备的访问控制。

拨入用户远端认证服务（Remote Authentication Dial-In User Service, RADIUS）, 是一套分布式网络安全系统，用以确保网络远程访问的安全性，同时它又是一个使用 UDP 的客户端/服务器协议（a client/server protocol）。RADIUS 是开放标准。

如你拥有 TACACS+ 或者 RADIUS，那么你可能希望开启认证、授权和记账（Authentication, Authorization, and Accounting, AAA）。AAA 是安装在一台服务器上的，它监测着网络的一个用户帐号数据库。用户访问、协议、连接，以及断开原因，及其它很多特性都能被监测到。

路由器和交换机可被设置为在某用户尝试登入时查询服务器。服务器此时来验证用户。CCNA 考试不要求你去配置这些协议。
```

### [路由器时钟及 NTP， Router Clock and NTP](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#路由器时钟及-ntp-router-clock-and-ntp)

```
交换机上的时间经常被忽略；但它却是重要的。在你遇到安全入侵（security violations）、SNMP 问题（SNMP traps）, 或者事件记录时，会用到时间戳。如交换机上的时间不正确，就会难于找出时间发生的时间。举个例子，让我们看看下面的交换机，并检查一下它的时间。

Switch#show clock
*23:09:45.773 UTC Tue Mar 2 1993
该时间是不准确的，所以我们要修改一下。但首先，我们要设置一些属性值。

clock timezone CST -6
clock summer-time CDT recurring
clock summer-time CST recurring 2 Sun Mar 2:00 1 Sun Nov 2:00
首先，我们设置时区（the time zone）。我是位于中部时区（the Central time zone）， 比 GMT 要早 6 个小时。接着告诉交换机夏令时（时间变化，the time change）是循环的。最后设置夏令时具体是什么。此时，我们就可以设置时间和日期了。

Switch#clock set 14:55:05 June 19 2007
Switch#
1d23h: %SYS-6-CLOCKUPDATE: System clock has been updated from 17:26:01 CST
Tue Mar 2 1993 to 14:55:05 CST Tue Jun 19 2007, configured from console by console.
Switch#show clock
14:55:13.858 CST Tue Jun 19 2007
请注意，时钟设置实在使能模式（Enable mode），而不是配置模式下。除了手动设置时钟外，你可以使用网络时间协议（Network Time Protocol, NTP）。它让你可将交换机的时钟与某台原子钟（an atomic clock）同步，保证非常精确的时间。

Switch(config)#ntp server 134.84.84.84 prefer
Switch(config)#ntp server 209.184.112.199
使用下面的两个命令，你可以查看时钟是否已经和 NTP 源保持同步。

Switch#show ntp associations
Switch#show ntp status
在第 40 天中，我们会涉及更多有关 NTP 的内容。

关闭未用到的那些端口，Shut Down Unused Ports
未使用的，或者说“空起的”那些没有任何网络设备的端口，因为某人会插入一条网线并将未授权设备连接到网络，而引发安全威胁。这会导致一些安全问题，包括。

网络未能如同与其的那样运作
网络信息暴露于外部人员
这就是为何你要关闭路由器、交换机及其它网络设备上，所有未使用端口的原因。依据具体设备，关闭状态可能是端口默认的状态，但你仍要对此进行验证。

而关闭端口是通过在接口配置模式下使用 shutdown 命令完成的。

Switch#conf t
Switch(config)#int fa0/0
Switch(config-if)#shutdown
验证某端口处于关闭状态有多种方法，其一就是使用 show ip interface brief 命令。

Router(config-if)#do show ip interface brief
Interface           IP-Address  OK? Method  Status                  Protocol
FastEthernet0/0     unassigned  YES unset   administratively down   down
FastEthernet0/1     unassigned  YES unset   administratively down   down
请注意，管理性关闭状态就是说该端口是手工关闭的。验证关闭状态的另一方法是使用 show interface 命令。


Router#show interface fa0/0
FastEthernet0/0 is administratively down, line protocol is down
    Hardware is Gt96k FE, address is c200.27c8.0000 (bia c200.27c8.0000)
    MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
......
思科发现协议， Cisco Discovery Protocol, CDP
```

[思科发现协议， Cisco Discovery Protocol, CDP](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#思科发现协议-cisco-discovery-protocol-cdp)

```
现在来讨论思科发现协议正是时候。

CDP 因为其在做出任何配置之前，就提供了一种发现有关网络设备信息的方法，而是一个热门的考试考点。它是一直非常有用的故障排除工具；但它又带来了安全威胁。

CDP 是一个思科专有协议，也就是说它只运行在思科设备上。它是一种二层服务, 设备用它来通告和接收那些直接连接设备的基本信息。IEEE 版本的 CDP 叫做链路层发现协议（Link Layer Discovery Protocol, LLDP）, CCNA 大纲并不包含此内容。

因为 CDP 是一种二层服务，所以它并不需要配置有 IP 地址来交换信息。只需开启接口就行。如有配置 IP 地址，该 IP 地址也会包含进 CDP 消息中。

CDP 作为非常强大的故障排除工具，考试中要求你掌握如何来使用它。图 4.1 展示了 Router 0 的 CDP 输出。请设想一下在没有拓扑图（topology diagram）的情况下，你要对此网络进行故障排除的情形。

Router 0 的 CDP 输出

图 4.1 -- Router 0 的 CDP 输出

下列配置输入，正是图 4.1 中的。

Router0#show cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge, S - Switch, H -
Host, I - IGMP, r - Repeater, P - Phone
Device ID   Local Interface Holdtime    Capability  Platform    Port
Switch      Fas 0/0         165         S           2960        Fas 0/1
Router      Fas 0/1         169         R           C1841       Fas 0/0
Router0#
在上述命令的后面加上 detail 命令，你可以看到更多信息。

Router0#show cdp neighbors detail
Device ID: Switch
Entry address(es):
Platform: cisco 2960, Capabilities: Switch
Interface: FastEthernet0/0, Port ID (outgoing port): FastEthernet0/1
Holdtime: 178
Version :
Cisco IOS Software, C2960 Software (C2960-LANBASE-M), Version 12.2(25)FX, RELEASE
SOFTWARE (fc1)
Copyright (c) 1986-2005 by Cisco Systems, Inc.
Compiled Wed 12-Oct-05 22:05 by pt_team
advertisement version: 2
Duplex: full
---------------------------
Device ID: Router
Entry address(es):
    IP address : 192.168.1.2
Platform: cisco C1841, Capabilities: Router
Interface: FastEthernet0/1, Port ID (outgoing port): FastEthernet0/0
Holdtime: 122
Version :
Cisco IOS Software, 1841 Software (C1841-ADVIPSERVICESK9-M), Version 12.4(15)T1, RELEASE
SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 18-Jul-07 04:52 by pt_team
advertisement version: 2
Duplex: full
现在你可以看到 IOS 版本、型号、IP 地址以及其它信息。记住现在你仍未在 Router 0 上配置 IP 地址。

前面我们已经讲过怎样在整台设备或仅在某个接口上关闭 CDP 了。而另两个有关命令是显示设备有关 CDP 的协议信息的 show cdp 命令，以及通过输入设备名称来查看某台具设备信息的 show cdp entry <Router> 命令。建议在今天要配置的实验中花些时间，来查看 CDP 的众多输出。


Router0#show cdp
Global CDP information:
    Sending CDP packets every 60 seconds
    Sending a holdtime value of 180 seconds
    Sending CDPv2 advertisements is enabled
Router0#show cdp ?
  entry       Information for specific neighbor entry
  interface   CDP interface status and configuration
  neighbors   CDP neighbor entries
  traffic     CDP statistics
  |           Output modifiers
  <cr>
```

## [交换机端口安全，Switch Port Security](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#交换机端口安全switch-port-security)

```
端口安全特性，是通过限制某个特定端口或是接口能够学习到的 MAC 地址数目，来保护交换机端口安全，并最终确保内容可寻址存储器（Content Addressable Memory, CAM）表的安全的一项，Catalyst 交换机的有力特性。具备了端安全特性，交换机就能够维护一张用于明确哪个 MAC 地址（或哪些地址），可以接入哪些本地交换机端口的表格。此外，交换机同样可以配置为仅允许在任何给定的端口上学习到指定数量的 MAC 地址。端口安全如图 4.2 所示。

注：关于CAM的更多信息，请参考 CAM (Content Addressable Memory) VS TCAM (Ternary Content Addressable Memory)。

"端口安全的运作"

图 4.2 -- 端口安全的运作

图 4.2 展示了在某台 Catalyst 交换机上，通过端口安全特性配置的 4 个端口，它们都只允许单一 MAC 地址接入。从 1 号到 3 号端口连接的 MAC 地址与端口安全所允许的地址匹配。在没有其它过滤的情况下，这些主机就能够经由其各自交换机端口转发流量。而端口 4 上所配置的是允许 AAAA.0000.0004 MAC 地址，但所接入的 MAC 地址却是 BBBB.0000.0001。因为主机 MAC 地址与所允许的 MAC 不一样，端口安全（port security）将在端口上做出如同管理员所设定的适当动作。这些有效端口安全动(the valid port security actions)作将在接下来的部分详细说明。

端口安全特性设计用于保护交换局域网（the switched LAN）免受两种主要的攻击方式。这两种方式在下的小节讲到。

CAM 表溢出攻击， CAM table overflow attacks
MAC 欺骗攻击， MAC spoofing attacks
```

### [CAM 表溢出攻击](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#cam-表溢出攻击)

```
交换机的 CAM 表是一些存储位置，这些存储位置包含了物理端口上的那些 MAC 地址，及其 VLAN 参数。交换机 CAM 表中动态学习到的内容，或者说 MAC 地址表，可通过命令 show mac-address-table dynamic 查看到，如下面的输出所示。

VTP-Server-1#show mac-address-table dynamic
            Mac Address Table
-------------------------------------------
Vlan    Mac Address         Type        Ports
----    -----------         --------    -----
   2    000c.cea7.f3a0      DYNAMIC     Fa0/1
   2    0013.1986.0a20      DYNAMIC     Fa0/2
   6    0004.c16f.8741      DYNAMIC     Fa0/3
   6    0030.803f.ea81      DYNAMIC     Fa0/4
   8    0004.c16f.8742      DYNAMIC     Fa0/5
   8    0030.803f.ea82      DYNAMIC     Fa0/6
Total Mac Addresses for this criterion: 6
如同所有的计算装置一样，交换机的存储资源也是有限的。这就意味着 CAM 表的存储空间是固定的，已分配好的。CAM 表溢出攻击（CAM table overflow attacks）将此限制作为目标，用大量随机生成的无效源及目的 MAC 地址灌入交换机，直到填满 CAM 表，此时交换机就无法接收新的 CAM 表条目了。在此情况下，交换机成为了一台集线器，只能开始简单地将新近接收的帧广播到其上的所有接口（同一 VLAN 中的），就是将该 VLAN 变成了一个大的广播域。

对 CAM 表的攻击易于开展，因为有着像 MACOF 及 DSNIFF 等常见的工具可用于实施这样的行为。而增加 VLANs 的数目（此举减少了广播域的尺寸），可有助于降低 CAM 表攻击的影响，在交换机上配置端口安全特性，是推荐的安全方案。

MAC 欺骗攻击，MAC Spoofing Attacks
MAC 地址欺骗，用于冒充某个源 MAC 地址，以达到扮演网络上的其它主机或设备的目的。冒充（spoofing）就是伪装成或扮着是并非你本人的某个人。MAC 地址欺骗的主要目的是扰乱交换机，令到其以为某台同一主机连接到两个端口上，这就导致交换机尝试同时将帧转发给受信任的主机和攻击者。图 4.3 展示了连接4 台不同网络主机的交换机的 CAM 表。

"交换机 CAM 表的建立"

图 4.3 中, 交换机允许正常，根据 CAM 表条目，它知道连接至其端口上的所有设备的 MAC 地址。而基于当前的 CAM 表，如 4 号主机想要发给 2 号主机一个帧，交换机就会简单地将该帧转发出它的 FastEthernet 0/2 接口，而前往 2 号主机。

现在，假设 1 号主机被某个想要接收所有发往 2 号主机流量的攻击者入侵了。则经由 MAC 地址欺骗，攻击者精心构建出使用 2 号主机源地址的以太网帧。在交换机收到该帧后，它记下该源地址，并重写 CAM 表中 2 号主机所对应的条目，将其指向 FastEthernet 0/1 端口，而不是 2 号主机所真正连接的 FastEthernet 0/2。此概念如图 4.4 所示。


```

### [MAC 欺骗攻击，MAC Spoofing Attacks](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#mac-欺骗攻击mac-spoofing-attacks)

```
MAC 地址欺骗，用于冒充某个源 MAC 地址，以达到扮演网络上的其它主机或设备的目的。冒充（spoofing）就是伪装成或扮着是并非你本人的某个人。MAC 地址欺骗的主要目的是扰乱交换机，令到其以为某台同一主机连接到两个端口上，这就导致交换机尝试同时将帧转发给受信任的主机和攻击者。图 4.3 展示了连接4 台不同网络主机的交换机的 CAM 表。

"交换机 CAM 表的建立"

图 4.3 中, 交换机允许正常，根据 CAM 表条目，它知道连接至其端口上的所有设备的 MAC 地址。而基于当前的 CAM 表，如 4 号主机想要发给 2 号主机一个帧，交换机就会简单地将该帧转发出它的 FastEthernet 0/2 接口，而前往 2 号主机。

现在，假设 1 号主机被某个想要接收所有发往 2 号主机流量的攻击者入侵了。则经由 MAC 地址欺骗，攻击者精心构建出使用 2 号主机源地址的以太网帧。在交换机收到该帧后，它记下该源地址，并重写 CAM 表中 2 号主机所对应的条目，将其指向 FastEthernet 0/1 端口，而不是 2 号主机所真正连接的 FastEthernet 0/2。此概念如图 4.4 所示。

!["MAC 地址欺骗"](images/0404.png width=800)

根据图 4.4, 在 3 号主机或 4 号主机尝试将帧发给 2 号主机时，交换机会将这些帧转发出 FastEthernet 0/1, 到 1 号主机，因为 CAM 表已被 MAC 地址欺骗攻击投毒。在 2 号主机发出另一个帧时，交换机再次从 FastEthernet 0/2 了解其 MAC 地址, 并再度将 CAM 表条目重写，以反应出该变化。结果就出现 2 号主机与 1 号主机之间就谁保有此 MAC 地址的拔河。

此外，这也将扰乱交换机，造成反复的重写 MAC 地址表条目，引发在合法主机（也就是 2 号主机）上的拒绝服务攻击（Denial of Service , DoS）。而假如假冒的 MAC 地址数目很高，MAC 地址欺骗攻击还将对持续重写其 CAM 表的交换机的性能造成严重影响。应用端口安全(implementing port security)，可以减轻 MAC 地址欺骗攻击的影响。
```

### [地址安全的端口安全，Port Security Secure Addresses](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#地址安全的端口安全port-security-secure-addresses)

```
经由端口安全特性，我们可以指定特定 MAC 才被允许访问某个交换机端口，同时限制某个单一交换机端口所支持的 MAC 地址数目。以下本节所说明的几种端口安全应用方式。

静态 MAC 地址保全, Static secure MAC addresses
动态 MAC 地址保全, Dynamic secure MAC addresses
粘滞 MAC 地址保全, Sticky secure MAC addresses
静态 MAC 地址保全是由网络管理员静态配置，并存储在 MAC 地址表中，同时还保存在交换机配置文件里。当将静态 MAC 地址保全指派给某个安全端口时，交换机不会转发那些源地址与所配置的静态安全 MAC 地址不匹配的帧。

动态 MAC 地址保全，是交换机所学习到的，存储在 MAC 地址表中。与静态 MAC 地址安全不同，在交换机重启或断电后，动态安全 MAC 地址条目会从交换机中移除。在交换机再次启动时，这些地址要再次习得。

粘滞的 MAC 地址保全，是静态和动态 MAC 地址保全的结合。地址可动态习得，也可静态配置，存储在 MAC 地址表中，也保存在交换机配置文件里。这就意味着在交换机关闭或是重启后，它无需再次动态发现 MAC 地址，因为这些 MAC 地址已经保存在配置文件中了（如你有保存允许的配置）。
```

### [动作的端口安全，Port Security Actions](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#动作的端口安全port-security-actions)

```
一旦开启了端口安全，管理员就可定义出在出现违反端口安全事件后，交换机所采取的动作了。思科 IOS 软件允许管理员指定 4 种在出现冲突时所采取的不同动作。

保护，Protect
关闭（默认动作）, Shutdown(default)
限制，Restrict
关闭 VLAN （超出 CCNA 大纲）, Shutdown VLAN(outside of the CCNA syllabus)
保护动作选项强制端口进入受保护端口模式（Protected Port mode）。此模式下，交换机会简单地丢弃所有源地址不明的单播和多播帧（simply discard all Unicast or Multicast frames with unknown source MAC addresses）。而在交换机被配置为保护某端口时，当其以受保护端口模式运行时，不会发出通知，这就意味着由处于此模式下的交换机端口阻止所有流量时，管理员是无法获知的。

关闭动作选项则是在出现违反端口安全后，将某端口置于某种错误关闭状态（an err-disabled state）。在此配置动作被用到时，交换机上相应端口的 LED 同时被关闭。而在关闭模式下，交换机发出一条 SNMP trap (浅谈 Linux 系统中的 SNMP trap), 以及一条 syslog 消息，同时冲突计数器会增大。这个选项是接口配置了端口安全时的默认动作。

限制动作选项是在安全 MAC 地址数目到达管理员为该端口所定义的最大限制时，用于丢弃那些带有不明 MAC 地址的数据包。此模式下，交换机会持续限制额外的那些 MAC 地址发出帧，直到移除对那些安全 MAC 地址数目的限制，或直到所允许的最大地址数目得以增加。和关闭工作选项一样，交换机也会发出一条 SNMP trap 及一条 syslog 消息，同时冲突计数器会增加。

关闭 VLAN 动作选项跟关闭动作选项类似；不过此选项是关闭某个 VLAN, 而不是某个交换机端口。此配置可能会应用在那些指派了多个 VLAN， 诸如语音 VLAN 和数据 VLAN， 的端口上，以及交换机的中继链路上。
```

### [端口安全配置， Configuring Port Security](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#端口安全配置-configuring-port-security)

```
在配置端口安全之前，建议将交换机端口静态配置为二层接入端口（端口安全只能配置为静态接入端口或中继端口上，不能配置在动态端口上）。此配置如下面的输出所示。

VTP-Server-1(config)#interface FastEthernet0/1
VTP-Server-1(config-if)#switchport
VTP-Server-1(config-if)#switchport mode access
注意: 在诸如 Catalyst 2950 及 Catalyst 2960 系列的二层交换机上无需 switchport 命令。而在比如 Catalyst 3750、Catalyst 4500 以及 Catalyst 6500 系列等的多层交换机上， 它是要要到的。

默认情况下，端口安全是关闭的；但可通过接口配置命令 switchport port-security [mac-address {mac-address} [vlan {vlan-id | {access | voice}}] | mac-address {sticky} [mac-address | vlan {vlan-id | {access | voice}}] [maximum {value} [vlan {vlan-list | {access | voice}}]] 予以开启。表 4.1 说明了该命令的这些选项。

关键字	说明
mac-address {mac-address}	此关键字用于指定一个静态保全 MAC 地址。你还可以加入不超过配置的最大数目的其它安全 MAC 地址。
vlan {vlan id}	此关键字应只使用在某个中继端口上，以指定 VLAN ID 和 MAC 地址。如没有指定 VLAN ID，就使用原生 VLAN。
vlan {access}	此关键字应只用在某个接入端口上，以指定该 VLAN 作为接入 VLAN。
vlan {voice}	此关键字应只用在某个接入端口上, 用以知道该 VLAN 作为一个语音 VLAN。而只有在该特定端口上配置了语音 VLAN 时，该选项才可用。
mac-address {sticky} [mac-address]	此关键字用于在特定接口上开启动态或地址粘滞学习（used to enable dynamic or sticky learning），或者为其配置一个静态安全 MAC 地址。
maxium {value}	此关键字用于指定某个接口上可以学到的安全地址的最大数目。默认是 1。
```

### [静态安全地址配置， Configuring Static Secure MAC Addresses](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#静态安全地址配置-configuring-static-secure-mac-addresses)

```
下面的输出演示了怎样在某个接口上开启端口安全，以及在某个交换机接入端口上配置一个静态安全 MAC 地址 001f:3c59:d63b。

VTP-Server-1(config)#interface GigabitEthernet0/2
VTP-Server-1(config-if)#switchport
VTP-Server-1(config-if)#switchport mode access
VTP-Server-1(config-if)#switchport port-security
VTP-Server-1(config-if)#switchport port-security mac-address 001f.3c59.d63b
下面的输出演示了怎样在某个接口上开启端口安全，并在某个交换机中继端口的 VLAN 5 中配置一个静态安全 MAC 地址 001f:3c59:d63b。

VTP-Server-1(config)#interface GigabitEthernet0/2
VTP-Server-1(config-if)#switchport
VTP-Server-1(config-if)#switchport trunk encapsulation dot1q
VTP-Server-1(config-if)#switchport mode trunk
VTP-Server-1(config-if)#switchport port-security
VTP-Server-1(config-if)#switchport port-security mac-address 001f.3c59.d63b vlan 5
而下面的输出则演示了如何在某个接口上开启端口安全，并在某个交换机接入端口的 VLAN 5(数据 VLAN） 和 VLAN 7(语音 VLAN），分别配置一个静态安全 MAC 地址 001f:3c59:5555 和 001f:3c59:7777。

VTP-Server-1(config)#interface GigabitEthernet0/2
VTP-Server-1(config-if)#switchport
VTP-Server-1(config-if)#switchport mode access
VTP-Server-1(config-if)#switchport access vlan 5
VTP-Server-1(config-if)#switchport voice vlan 7
VTP-Server-1(config-if)#switchport port-security
VTP-Server-1(config-if)#switchport port-security maximum 2
VTP-Server-1(config-if)#switchport port-security mac-address 001f.3c59.5555 vlan access
VTP-Server-1(config-if)#switchport port-security mac-address 001f.3c59.7777 vlan voice
记住在某个同时配置了语音 VLAN 和数据 VLAN 的接口上开启端口安全时，该端口上的最大允许安全地址数应设置为 2，这一点非常重要。这又是通过包含在上面输出中的接口配置命令 switchport port-security maxium 2 完成的。

两个 MAC 地址中的一个由 IP 电话使用，交换机在语音 VLAN 上学到此地址。另一个由可连接在 IP 电话上的主机（比如 PC）所使用。交换机将在数据 VLAN 上学到这个 MAC 地址。
```

### [静态安全地址配置的验证，Verifying Static Secure MAC Address Configuration](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#静态安全地址配置的验证verifying-static-secure-mac-address-configuration)

```
同过执行 show port-security 命令，可以验证全局端口安全配置参数（global port security configuration parameters）。下面展示了默认值下的此命令的打印输出。

VTP-Server-1#show port-security
Secure Port MaxSecureAddr  CurrentAddr SecurityViolation   Security Action
           (Count)        (Count)      (Count)
-------------------------------------------------------
Gi0/2       1               1             0               Shutdown
------------------------------------------------------------------
Total Addresses in System : 1
Max Addresses limit in System : 1024
如同上面的输出中所见到的那样，默认情况下，每个端口上仅允许一个安全 MAC 地址。此外，在出现冲突事件时的默认动作就是关闭端口。粗体文本表明，已知仅有一个安全地址，就是配置在接口上的静态地址。经由执行 show port-security interface [name] 亦可确认同样的参数，如下面的输出所示。

VTP-Server-1#show port-security interface gi0/2
Port Security : Enabled
Port status : SecureUp
Violation mode : Shutdown
Maximum MAC Addresses : 1
Total MAC Addresses : 1
Configured MAC Addresses : 1
Sticky MAC Addresses : 0
Aging time : 0 mins
Aging type : Absolute
SecureStatic address aging : Disabled
Security Violation count : 0
注意： 在我们进一步学习本章内容的过程中，将会详细介绍对上面的输出中其它默认参数的修改。

而要查看该端口上具体配置的静态安全 MAC 地址，就要用到 show port-security address 或者 show running-config interface [name] 命令了。以下输出演示了 show port-security address。


VTP-Server-1#show port-security address
          Secure Mac Address Table
-------------------------------------------------------------------
Vlan    Mac Address       Type                 Ports   Remaining Age
                                                          (mins)
----    -----------       ----                 -----   -----------
   1    001f.3c59.d63b    SecureConfigured     Gi0/2       -
--------------------------------------------------------------------
Total Addresses in System : 1
Max Addresses limit in System : 1024
```

### [动态安全 MAC 地址的配置，Configuring Dynamic Secure MAC Address](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#动态安全-mac-地址的配置configuring-dynamic-secure-mac-address)

```
默认情况下，当某个端口的端口安全开启时，该端口无需管理员做任何配置，就会动态学习并将学习到的 MAC 地址设为安全 MAC 地址。而要令到该端口学到不止一个 MAC 地址并将它们设为安全 MAC 地址，就要使用命令 switchport port-security maxium [number]。记住 [number] 关键字是依平台而定的，在不同的思科 Catalyst 交换机型号上会有所不同。

"现实场景"

现实场景部署，Real-World Implementation

在使用思科 Catalyst 3750 交换机的生产网络中，事先确定下来某台特定交换机的用途，总是一个好主意，接着就可以通过全局配置命令（global configuration command） sdm prefer {access | default | dual-ipv4-ipv6 {default | routing | vlan} | routing | vlan} [desktop], 选定恰当的交换机数据库（Switch Database Management, SDM）模板。

各个 SDM 模板以支持正在或即将用到的那些特性的最优方式，来分配系统资源。默认的 SDM 模板则是尝试在各项特性间提供一种平衡。因此，会影响其它各项特性和功能的最大性能值。一个例子就是在采行端口安全时，所能学到或配置上的安全 MAC 地址最大可能数会减少。

下面的输出演示了怎样将交换机端口，接口 GigabitEthernet0/2, 配置为动态学习并将至多两个 MAC 地址设为安全 MAC 地址。


VTP-Server-1(config)#interface GigabitEthernet0/2
VTP-Server-1(config-if)#switchport
VTP-Server-1(config-if)#switchport mode access
VTP-Server-1(config-if)#switchport port-security
VTP-Server-1(config-if)#switchport port-security maximum 2
```

### [验证动态 MAC 地址保全，Verifying Dynamic Secure MAC Addressed](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#验证动态-mac-地址保全verifying-dynamic-secure-mac-addressed)

[配置保全 MAC 地址粘滞，Configuring Sticky Secure MAC Addresses](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#配置保全-mac-地址粘滞configuring-sticky-secure-mac-addresses)

[配置端口安全冲突的动作， Configuring the Port Security Violation Action](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#配置端口安全冲突的动作-configuring-the-port-security-violation-action)

[对端口安全冲突动作的验证，Verifying the Port Security Violation Action](https://ccna60d.xfoss.com/d04-Router-and-Switch-Security.html#对端口安全冲突动作的验证verifying-the-port-security-violation-action)



# ip地址分配

**上面的基础知识，是 IP 寻址和子网划分的基础。** 下面的对你现在所掌握的进行了总结。这些值可用作任意子网掩码，所以请留心一下。

** 二进制值，Binary Values**

| 二进制，Binary | 十进制，Decimal |
| -------------- | --------------- |
| `1000 0000`    | `128`           |
| `1100 0000`    | `192`           |
| `1110 0000`    | `224`           |
| `1111 0000`    | `240`           |
| `1111 1000`    | `248`           |
| `1111 1100`    | `252`           |
| `1111 1110`    | `254`           |
| `1111 1111`    | `255`           |

ip规则

## a,bc类地址

```
在 IPv4 刚推出时，其地址就分成了不同类别。不同地址类别依其需求而分配给各家机构。机构越大，地址类别就越大。不同地址类别又指定了相应字母，从A到E。A 类地址保留给最大的一些网络。而A类地址的前8个二进制位可以是从1到126的数。此举的原因在于其前 8 位的首位必须是0。而当前8位中有了第一位的0时，那么剩下的值就只能是1到126了。也就是下面这样。

0000 0001 = 1

0111 1111 = 127

在网络中，是不可以有全0地址的。在加入其它三个8位二进制数后，就可以看到A类地址的全貌了。就像下面的那样。

10.1.1.1

120.2.3.4

126.200.133.1

这些都是A类地址，因为它们都是在1到126的范围内。127不是 IP 地址所允许的数字；127.0.0.1实际上用于在设备上测试TCP/IP是否正常。

B类地址前8位二进制数的头两位则必须是 10 。这就意味着前8位二进制数值处于128到191之间，也就是下面这样。
1000 0000 = 128

1011 1111 = 191

对于C类地址来说，前8位二进制数的头三位必需为110, 那么地址就在192到223之间，也就是下面这样。

1100 0000 = 192

1101 1111 = 223

D类地址用于多播（multicasting, directed broadcasting, 受导向的广播），而E类地址则仅用于实验用途。

D类地址用于多播（multicasting, directed broadcasting, 受导向的广播），而E类地址则仅用于实验用途。
```

# [子网掩码初步，Subnet Mask Primer](https://ccna60d.xfoss.com/d05-IP-Addressing.html#子网掩码初步subnet-mask-primer)



```
先前提到过 IP 地址用于区分网络的部分以及用于区分网络上主机地址的部分。子网掩码的作用就是确立此两部分。难点就在于并不总是能仅仅看一眼子网掩码，就能知道 IP 地址的网络部分和主机部分。这需要实践，且对于那些更难的地址，你就必须要动手计算出来（或是使用某个子网计算程序来作弊）。

就算未曾将网络划分成更小的部分，你仍需采用为用到的每个地址应用一个子网掩码。而上面提到的地址类，它们都有一个默认的子网掩码，如同下面这样。

A类地址 = 255.0.0.0 B类地址 = 255.255.0.0 C类地址 = 255.255.255.0

在二进制位开启时，网络就知道该位是用作网络地址，而不是网络上的主机地址，如下表所示。

-	-	-	-
192	168	12	2
255	255	255	0
网络位	网络位	网络位	主机位
上面的地址表明 192.168.12 是网络地址，2 是该网络上的一台主机。再者，任何以192.168.12开头的 IP 地址，都是在同一网络上的。而在看看前8位的数字，以及该默认的子网掩码，就知道这是一个C类网络。

请记住早前提到的规则：主机所不能使用的那些网络号，那么下面的这些网络号就不能为设备所使用了。

10.0.0.0

174.12.0.0

192.168.2.0

另一规则是你不能使用各个网络或子网上的广播地址。某广播地址是前往网络上所有设备，那么，逻辑上就不能为设备所使用了。广播地址就是将所有主机位开启的地址，像下面这样。

10.255.255.255

192.168.1.255

在上面的例子中，主机部分的所有二进制位都是打开的。
```

# [NAT 基础，NAT Basics](https://ccna60d.xfoss.com/d06-NAT.html#nat-基础nat-basics)

NAT概述

NAT（Network Address Translation），网络地址转换

- 主要应用在企业网络的边缘设备上
- 对数据包的私有IP地址和公有IP地址进行转换，实现内网到外网的访问
- 实现企业内网的保护，增强企业内网的安全性。因为外网无法直接访问内部设备的私有IP地址



NAT工作原理

**路由器对数据包进行地址转换，路由器在接收到内部数据包时将内部源IP地址转化为公有IP地址后在进行路由转发。**



**NAT核心工作表：NAT转换表**



## NAT技术：实现[外网访问内网](https://hsk.oray.com/)

假如电脑A想要访问百度，百度的IP我们假设为：172.168.30.3：

我们都知道，电脑A的IP是我们虚构的，实际上可能并不存在这样一个IP，如果用电脑A的IP去访问百度，那肯定行不通。

我们也知道，由于百度和电脑A不在一个局域网内，所以A要访问百度，那么必须得经过网关。而网关的这个IP地址，是真实存在的，是可以访问百度的。

为了让 A 可以访问百度，那么我们可以采取这样的方法：让网关去帮助 A 访问，然后百度把结果传递给网关，而网关再把结果传递给 A，这样不就可以解决了?

不过电脑A、B、C都可能拜托网关去帮忙访问百度，而百度返回的结果 的目的IP都是网关的IP=192.168.1.1。那么网关该如何进行区分这结果是A的、B的还是C的呢?

我们去访问百度的时候，不是需要指定一个端口吗?只要我们把 A的IP + 端口 映射成 网关的IP+端口，不就可以唯一确定身份了?

例如A用端口60去访问百度，网关把 A的IP+端口60 映射成 网关的IP+端口80 不就可以了?

百度把结果返回给网关的80端口之后，网关再通过映射表，就可以把结果返回给 A的60端口 了。

如果B也是用60端口去访问百度的话，也是一样，可以把它映射到90端口。

这种方法地址的映射转换，我们也称之为网络地址转换，英文为 Network Address Translation，简称NAT。

而像A、B、C这样的IP地址我们也称之为内网IP，即内网IP;而像网关，百度这样的IP我们称之为外网IP(即互联网公网IP)。

### 

## 静态nat

**静态NAT**

- **NAT表条目是通过手动配置的方式添加进去的**
- **私有IP地址和公有IP地址是 1对1 的关系，不节省公网IP地址**

**静态NAT可以实现内网的PC1与外网的设备的互通，但是内网的其它设备无法与外网的设备互通**

静态NAT存在的弊端：

- 静态NAT中私有地址和公有地址是1:1的关系，并不节省公网IP地址
- 内网主机非常多的时候，不节省配置，并且浪费钱





## 动态nat 和 nat地址池

**动态NAT**

- **NAT表中的条目是 路由器出炉数据包 时自动形成的**
- **基于NAT地址池 实现私有地址和公有地址之间的转换，比静态NAT更加节省公网IP**

公司内部私有地址主机数量非常多的时候，如果才有静态NAT为每个私有IP地址，就会浪费公网IP地址

在动态NAT中，企业可以同时购买多个公网IP地址，然后将这些公网IP地址，轮着给企业内网的每个主机使用

## 端口NAT（PAT）

- 在动态NAT技术突出的主要矛盾就是：用来进行地址转换的公网地址太少了。
- 以后在进行地址转换的时候，不仅仅是转换地址，还转换端口
- 因为一个公网地址，最多可以对应 65536 个端口号

**该接口上如果收到了一个目标IP地址为 100.1.1.20 的 TCP 80 的流量 那么就将这个目标IP地址转换为 192.168.10.10 的 tcp 80 。**

## NAT Server

如果想要实现外网到内网的访问那么必须得在公司的边界设（R1）上，提前设置“nat转换条目”并且这种条目，仅仅允许某一种特定的业务的流量。

- 企业内部有一个 web 服务器，私有IP地址 192.168.10.10/24
- 希望互联网用户，通过浏览器，访问公网地址 100.1.1.20 ，就可以获得我们公司内部的 web 服务器的网站

## nat故障排查

```
NAT 故障中十次有九次，都是由于路由器管理员忘记了把ip nat outside或ip nat inside命令加到路由器接口上。事实上，几乎总是存在这个问题！接下来最频繁的错误包括不正确的 ACL ，以及某个拼写错误的地址池名称（地址池是区分大小写的）。

使用命令debug ip nat [detailed]，可以在路由器上对 NAT 转换进行调试，又可以使用命令sh ip nat translations，来查看 NAT 地址池。
```

## 数据包从内网到外网

- - 怎么转换：私有→公有
  - 转换对象：源IP地址
  - 再查NAT表，实现地址转换
  - 先查路由表，为了确定出端口

- 数据包从外网到内网

- - 先查NAT表，实现地址转换
  - 再查路由表，确定去往内网主机的端口
  - 转换对象：目标IP地址
  - 怎么转换：公有→私

# ipv6

## 正确描述 IPv6 的各种地址

- 全球单播地址, Global Unicast addresses
- 多播地址, Multicast addresses
- 本地链路地址, Link-Link addresses
- 本地唯一地址，Unique-Local addresses
- 扩展唯一识别符，Extended Unified Identifier 64, EUI-64
- 自动配置地址（ autoconfiguration ）

## history

在Tim Berners-Lee爵士于`1989`年发明 WWW 时，他无法预测到该技术对世界的巨大影响。个人计算机曾经贵得高攀不起，此外，除非能够负担得起昂贵的 WAN 连接费用，否则就没有方便的长距离通信方法。那时也没有大家共同遵循的通信模型。

那时，某些事需要一些变化，以 IP 这种新型分址标准的的形式，变革发生了。业界从犯下的大量失误中终有收获，并在对商业需求的回应下， IETF 早在`1998`年就发布了众多 IPv6 标准中最早的一些标准。

并不会有一个日期，能够整个地从 IPv4 转变为 IPv6 ；而是网络将会逐渐地变为同时运行 IPv4 和IPv6, 并最终 IPv4 会滚粗。当下，全部互联网流量的近`1%`运行在 IPv6 上（来源：Yves Poppe, IPv6 -- A 2012 Report Card）。



## [IPv6下的ICMP](https://ccna60d.xfoss.com/d07-IPv6.html#ipv6下的icmp)

```
ICMPv6是IPv6的基础协议之一，用于向源节点传递报文转发的信息或者错误。
协议类型号（Next Header）：58
ICMPv6除了提供IPv4功能之外，还提供了邻居发现、无状态地址配置、重复地址检测、PMTU发现等等
```

### ICMPv6报头字段

![在这里插入图片描述](https://img-blog.csdnimg.cn/88eb8b9953ef42c1aa0cb01a6b7cbe4f.png)
Type：表明消息的类型，0至127表示差错报文类型，128至255表示消息报文类型。
Code：表示此消息类型细分的类型。
Checksum：表示ICMPv6报文的校验和。



## 错误报文

#### 目的不可达错误报文：

在IPv6节点转发IPv6报文过程中，当设备发现目的地址不可达时，就会向发送报文的源节点发送ICMPv6目的不可达错误报文，同时携带错误报文的具体原因。

#### 数据包过大错误报文：

在IPv6节点转发IPv6报文过程中，发现报文超过出接口的链路MTU时，则向发送报文的源节点发送ICMPv6数据包过大错误报文，其中携带出接口的链路MTU值。数据包过大错误报文是Path MTU发现机制的基础。

#### 时间超时错误报文：

当路由器收到Hop Limit字段值等于0的数据包，或者当路由器将Hop Limit字段值减为0时，会向发送报文的源节点发送ICMPv6超时错误报文。
对于分段重组报文的操作，如果超过定时时间，也会产生一个ICMPv6超时报文。

#### 参数错误报文：

当目的节点收到一个 IPv6 报文时，会对报文进行有效性检查，如果发现问题会向报文的源节点回应一个 ICMPv6 参数错误差错报文。

## **IPv6邻居发现协议NDP**

**The IPv6 Neighbor Discovery Protocol, NDP**

NDP实现了IPv6中许多重要机制

### 路由器发现

帮助设备发现链路上的路由器，并获得路由器通告的信息。

### 无状态自动配置

通过路由器通告的地址前缀，终端自动生成IPv6地址。无状态自动配置机制使用到了ICMPv6中的路由器请求报文（RS）及路由器通告报文（RA）。

### DAD重复地址检测

获得地址后，进行地址重复检测，确保地址不存在冲突。一个IPv6地址必须经历重复地址检测并通过检测之后才能够启用。

### 地址解析

请求目的网络地址对应的数据链路层地址，类似IPv4的ARP。使用NDP所定义的邻居请求报文（NS）及邻居通告报文（NA）来实现地址解析功能。

### 邻居状态跟踪

通过NDP发现链路上的邻居并跟踪邻居状态。IPv6定义了节点之间邻居的状态机，同时还维护邻居IPv6地址与二层地址如MAC的映射关系，相应的表项存储于设备的IPv6邻居表中。

### 前缀重编址

路由器对所通告的地址前缀进行灵活设置实现网络重编址。IPv6路由器能够通过ICMPv6的路由器通告报文（RA）向链路上通告IPv6前缀信息。通过这种方式，主机能够从RA中所包含的前缀信息自动构建自己的IPv6单播地址。当然这些自动获取的地址是有生存时间的。通过在RA中通告IPv6地址前缀，并且灵活地设定地址的生存时间，能够实现网络中IPv6新、老前缀的平滑过渡，而无需在主机终端上消耗大量的手工劳动重新配置地址。

### 路由重定向

告知其他设备，到达目标网络的更优下一跳





## [IPv6的有状态自动配置](https://ccna60d.xfoss.com/d07-IPv6.html#ipv6的有状态自动配置)

## [IPv6无状态自动配置](https://ccna60d.xfoss.com/d07-IPv6.html#ipv6无状态自动配置)



## IPv6和IPv4报头比较

去除了IHL、标识、flags、分段偏移、首部效验

## IPv6地址表示

简化规则1：每一个地址块的起始部分的0可以省略掉
简化规则2: 有1个或连续多个0组成的地址块可以用"::"取代



## IPv6地址结构

![在这里插入图片描述](https://img-blog.csdnimg.cn/454d9d289acf4136bdbe4a18755f1eac.png)
网络前缀：相当于IPv4中的网络位
接口ID：相当于IPv4中的主机位
接口ID的三种生成方法：①手工配置②系统通过软件自动生成③EUI-64

## 地址类型

组播地址、单播地址、任播地址。没有广播地址
单播地址分为：未指定地址、环回地址、链路本地地址、全球单播地址、唯一本地地址

单播地址用于标识一个接口，发往该目的地址的报文会被送到被标识的接口；
组播地址用于标识多个接口，发往该目的地址的报文会被送到被标识的所有接口；
任播地址用于标识多个接口，发往该目的地址的报文会被送到被标识的所有接口中最近的一个接口上。实际上任播地址与单播地址使用同一个地址空间，也就是说，由路由器决定数据包是做任播转发还是单播转发。

### 单播地址

全球单播地址
它是全局唯一的和全局可路由的。
类似于IPv4公网地址。
由前缀、子网ID和接收标识符组成。
允许路由前缀的聚合。

001：3bit，固定前缀
TLA（Top Level Aggregation）顶级聚合：13bit，IPv6管理机构根据TLA分配不同的地址给骨干网
RES：8bit，保留使用
NLA（Next Level Aggregation）次级聚合：24bit，骨干网ISP根据NLA为各个中小ISP分配不同地址段
SLA（Site Level Aggregation）站点级聚合：16bit，企业根据SLA分成不同网段，分配各站点使用

由001、TLA、RES、NLA组成的前缀叫全局路由前缀

### 链路本地地址

在一个节点启动IPv6协议栈时，节点的每个接口会自动配置一个链路本地地址
链路本地地址是IPv6中的范围受限制的地址类型，该地址只能于相同链路上主机通信
只能在连接到同一本地链路的节点之间使用，应用于邻居发现、无状态地址等
链路本地地址前缀FE80::/10，将接口ID添加在后面作为地址的低64位

#### 唯一本地地址

类似IPv4私网地址，只能在本地网络使用
唯一本地地址固定前缀FC00::/7。它被分为两块，FC00::/8暂未定义，另一块是FD00::/8

Prefix：前缀；固定为FC00::/7。
L：L标志位；值为1代表本地网络范围内使用的地址；值为0被保留，用于以后扩展。
Global ID：全球唯一前缀；通过伪随机方式产生（RFC4193）。
Subnet ID：子网ID；划分子网使用。
Interface ID：接口标识。

#### 未指定地址

0:0:0:0:0:0:0:0/128或者::/128
该地址作为某些报文的源地址，比如重复地址检测时发送的邻居请求报文NS的源地址，或者DHCPv6初始化过程中客户端所发送的请求报文的源地址

#### 环回地址

0:0:0:0:0:0:0:1/128或者::1/128
与IPv4中的127.0.0.1作用相同，用于本地回环

### IPv6组播地址

用来标识一组接口，发往组播地址的数据将被转发给侦听该地址的多个设备。
地址范围：FF00::/8

Flags：4bit，第一位都是零，格式|0|r|p|t|，通常0000或者0001
r位：取0表示内嵌RP，取1表示内嵌RP
p位：取0表示非基于单播前缀的组播地址，取1表示基于单播前缀的组播地址
t位：取0表示永久分配组播地址，取1表示临时分配组播地址
Scope：4bit，标识传播范围
0001 node（节点）：本地接口范围，仅用于Lookback
0010 link（链路）：本地链路范围
0101 Site（站点）：本地站点范围
1000 organization（组织）：本地组织范围，属于同一个组织多个站点
111 0 global（全球）：全局范围
Group ID：32bit，组播组ID

#### 预定义组播地址

Node-local（节点本地范围）
FF01:0:0:0:0:0:0:1，所有节点的组播地址
FF01:0:0:0:0:0:0:2，所有路由器的组播地址
Link-laocal（链路本地范围）
FF02:0:0:0:0:0:0:1，所有节点的组播地址。
FF02:0:0:0:0:0:0:2，所有路由器的组播地址。
FF02:0:0:0:0:1:FFXX:XXXX ，Solicited-Node组播地址。
FF02:0:0:0:0:0:0:5，所有OSPF路由器组播地址。
FF02:0:0:0:0:0:0:6，所有OSPF的DR路由器组播地址。
FF02:0:0:0:0:0:0:D，所有PIM路由器组播地址。

IPv6组播地址的MAC地址映射
组播IPv6报文中，目的IP地址是组播IPv6地址，目的MAC地址是组播MAC地址，该地址必须与组播IPv6地址对应
组播MAC地址高16位是3333，低32位与组播IPv6地址的低32位一致

被请求节点组播地址（Solicited-Node Multicast Address）
一个节点具有单播或任播地址，就会生成一个对应的被请求节点组播地址
前缀FF02::1:FF00:0/104和对应IPv6地址的最后24位组成
主要应用：邻居发现、地址重复检测功能

### IPv6任播地址

任播地址是IPv6特有的地址类型，用来标识一组网络接口
发往任播的报文只会被发送到最近的一个接口。
任播地址与单播地址使用相同的地址空间，因此任播与单播的表示无任何区别；
配置时须明确表明是任播地址，以此区别单播和任播。

## 迁移到 IPv6 所能带来的一些好处。

- 简化了的 IPv6 数据包头部
- 更大的地址空间
- IPv6层次化的分址方法
- IPv6的扩展性扩充性
- IPv6消除了广播
- 无状态的自动配置
- 集成移动能力
- 集成了安全增强

# **Integrating IPv4 and IPv6 Network Environments**

# [访问控制清单](https://ccna60d.xfoss.com/d09-ACL.html#第-9-天-访问控制清单)



# [路由的一些概念](https://ccna60d.xfoss.com/d10-Routing-Concepts.html#第-10-天-路由的一些概念)

# **Static Routing静态路由**

# OSPF

# DHCP&&DNS

# 一二层排错

# **Spanning Tree Protocol生成树协议**

# 以太网通道和链路聚合

# **First Hop Redundancy Protocols 第一跳冗余协议**

# ios与启动（硬件）

# [增强的内部网关路由协议](https://ccna60d.xfoss.com/d36-EIGRP.html#第-36-天-增强的内部网关路由协议) 

# snmap&&netflow

# 广域网wan

# 帧中继与点对点

# 词汇表：

## acl：控制访问列表
